{
  "chainId": 1,
  "delegates": [
    {
      "plaintext": "GM frens.  I've been a big supporter of Element Finance and I want to continue doing so as your delegate.\n\n___________________________________________________________________________\n\nEthereum Address: 0x72A916702BD97923E55D78ea5A3F413dEC7F7F85\n\nDiscord Handle (optional): prefer to remain anon\n\nTwitter Handle (optional): prefer to remain anon\n\n___________________________________________________________________________\n\nStatement of Intention\n\nI believe that Element Finance's modus operandi should be the benchmark for the industry. From product innovation to governance, Element has consistently proven its ability to ship and lead. I want to be a large contributing member of the community.  I started working and supporting Element in the fall of last year across all things such as seeding pools, providing feedback on products, as well as commenting on documentation.\n\nThis is only the beginning of Element Finance. Fixed rates and fixed rates products are pillars in the financial and economic system of the world so I believe there is a large opportunity for their suite of products to find product-market fit.\n\n___________________________________________________________________________\n\nWeb3 Qualifications / Skills (optional)\n\nI've been in Crypto since 2015 (with BTC mining and ATMs).  In 2017, I participated and contributed to the DeFi space with early projects like 0x Project and Kyber Network, then again with the resurgence of DeFi in 2019 (1st money in Compound and Curve).\n\nProjects I've worked with include:\n\nKeep Network and Pocket Network = node runners\n\nOndo Finance, Element Finance, and Curve/Compound = bootstrapping liquidity\n\nTokemak, Redacted Finance, Vesta Finance = Go-to-market and token launch plans/modeling\n\nWeb3 Skillset:\n\nIncubation —> tokenomics design, industry contacts for legal, taxes, compliance\n\nLive trading/DeFi —> bootstrapping LP\n\nExchange listing / Market Making contacts\n\n___________________________________________________________________________\n\nAreas of Interest\n\nTreasury management\n\nThe typical DeFi DAO has too large of a concentration of their native token. This is an issue. We need to efficiently and effectively balance their holdings. With my network of DAO leaders and liquid fund managers, I would be able to facilitate OTC deals as well as post-deal active treasury management.\n\nProtocol improvements\n\nElement's suite of products is definitely not the easiest to understand/use.  I think this is a low-effort but high-reward UX/UI design problem that we could solve through user testing.\n\nMy go-to source of information is documentation (aka docs).  And I believe that Element's docs require some love and I'm ready to give it to them.\n\nStrategic initiatives\n\nAs a DeFi native, I am a super fan of composability and hyper liquidity.  Element's PT tokens could act as the defacto savings account of DeFi.  I would lobby and push to have PT tokens as collateral on key lending protocols.\n\nFor example, why could we not mint PT tokens for a UST fixed term pool using the UST3CRV LP tokens.  Then collateralize those PT tokens to borrow USDT, swap for UST, then deposit the UST onto Anchor for additional yield.",
      "commonwealthCommentId": 18129,
      "commonwealthName": "Elemental_Kirby",
      "commonwealthPostedFromAddress": "0x72A916702BD97923E55D78ea5A3F413dEC7F7F85",
      "address": "0x72A916702BD97923E55D78ea5A3F413dEC7F7F85",
      "created_at": "2022-03-31T02:39:57.581Z",
      "ensName": null
    },
    {
      "plaintext": "Hi everyone! Great to meet you all.\n\n----------------------------------------------------------------------------------------------------------\n\nEthereum Address : justinbram.eth (0xAf98Bb4bCeD00A17fFE020499C342CFC3511Fb10)\n\nDiscord Handle : Justin Bram#3452\n\nTwitter Handle : @justincbram\n\n----------------------------------------------------------------------------------------------------------\n\nStatement of Intent\n\nI am incredibly passionate about DeFi, and I currently work on several different DeFi protocols as a founder, advisor, and multisig member. I'm especially excited about the opportunity to work with the Element community as I've been engaged in the Element ecosystem since I first covered it on my YouTube channel last July. I believe that Element can serve as a core building block for DeFi, and I would love the opportunity to help shape Element's governance.\n\nWeb3 Qualifications\n\nI've been working full-time in crypto for over two years now. I'm currently building a capital-efficient lending market called Astaria with my co-founder Joseph Delong. Before that, I led growth at Ondo Finance. My work involved partnering with 14+ other DAOs and growing TVL to over $100m. I also serve as a multisig for several other DeFi protocols and have a large YouTube channel that focuses on educational DeFi content. I covered Element on my channel and interviewed Windra last July.\n\nAreas of Focus :\n\nTreasury Management\n\nDeFi protocols are notoriously bad at treasury management. Most DAO treasuries consist of roughly 90%+ of their native token. This is not healthy for DAOs & projects, which should be building all-weather portfolios that allow for future growth regardless of market conditions. This is a major use case for Element's fixed yield product itself and something that I would like to help design internally for Element's DAO.\n\nEducation\n\nMy YouTube channel serves as a hype-free, educational resource for DeFi users. I also have a large, educational Discord community. I enjoy helping others learn about and experiment with DeFi and would love to bring this to the Element community.\n\nStrategic Initiatives\n\nI helped lead partnerships during my time at Ondo and would love to help with DAO-to-DAO relations at Element. I think I can add significant value by helping Element partner with other DAOs.",
      "commonwealthCommentId": 18119,
      "commonwealthName": "Justin Bram",
      "commonwealthPostedFromAddress": "0xAf98Bb4bCeD00A17fFE020499C342CFC3511Fb10",
      "address": "0xAf98Bb4bCeD00A17fFE020499C342CFC3511Fb10",
      "created_at": "2022-03-30T23:21:01.605Z",
      "ensName": "justinbram.eth"
    },
    {
      "plaintext": "Dear Element Finance Team and Community, my name is Robin Davids and I would like to present my application to become a delegate / GSC member.\n\nEthereum Address : 0x9F85221D7ec0dec8C4a28E5c7038Cfc4ad285a68\n\nDiscord Handle  (optional): RobinD57#9177\n\nTwitter Handle  (optional): @RobinDotETH\n\nStatement of Intention:\n\nI aim to drive forward the adoption of blockchain technology by supporting the teams and projects that are building value-add products and services in the space. I believe that Element Finance has incredible potential, an amazing product, and the right team to succeed in their vision. I am impressed with Element Finance and aligned with their vision for crafting a more collaborative and flexible financial environment for users and developers in DeFi. I would be honored to take an active part in this journey as a delegate.\n\nMy Background / Qualifications / Skills\n\nI am an early investor in the idea of ‘Blockchain’ having acquired my first $ETH in 2015. Ever since, I have remained an avid supporter and user of blockchain technology, in specific DeFi applications.\n\nI solidify my own beliefs and vision for the space by joining like-minded teams on their journeys. I work very closely with Rarestone ’s portfolio projects on refining their commercial, technical and token economic strategy. My speciality lies in analyzing and optimizing the game-theoretic components for aspiring decentralized protocols. More recently, I have taken on the role of Head of Strategy at Advanced Blockchain AG , a German-based public company that builds and invests in blockchain companies.\n\nAdditionally, my passion and the potential I see within this technology drives me to be deeply involved in the portfolio companies of both Rarestone and Advanced Blockchain AG. As a candidate I see myself adding value in all aspects of the protocol as I have a well-rounded background in the development, strategy, operations, growth, and sustainability of DeFi projects.",
      "commonwealthCommentId": 18099,
      "commonwealthName": "RobinD57",
      "commonwealthPostedFromAddress": "0x9F85221D7ec0dec8C4a28E5c7038Cfc4ad285a68",
      "address": "0x9F85221D7ec0dec8C4a28E5c7038Cfc4ad285a68",
      "created_at": "2022-03-30T18:33:03.299Z",
      "ensName": null
    },
    {
      "plaintext": "Good day, here's my application for becoming a GSC delegate & candidate.\n\nI am from China\n\nDiscord Handle:  UniverseLu#6557\n\nEthereum Address:  0x6674BaE9d14c578EAD66e7bA5D37b351e604Cb35\n\nTwitter Handle:  @UniverseLu1\n\nStatement of Intention:\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally.\n\nTherefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, Cosmos, AVAX, Polygon, Solana, Terra and Cosmos.\n\n- Yield farming, trading, delta neutral.\n\n- Research & translation: Curvance",
      "commonwealthCommentId": 18080,
      "commonwealthName": "UniverseLu",
      "commonwealthPostedFromAddress": "0x6674BaE9d14c578EAD66e7bA5D37b351e604Cb35",
      "address": "0x6674BaE9d14c578EAD66e7bA5D37b351e604Cb35",
      "created_at": "2022-03-30T16:25:05.867Z",
      "ensName": "pigcoin.eth"
    },
    {
      "plaintext": "Happy to apply elementfi’s GSC!\n\nEthereum Address:\n\n0xc4Dc8BbC777213aAcb55015672EFfa4B1A56118e\n\nStatement of Intention:\n\nI like trying new thing\n\nWeb3 Qualifications / Skills:\n\nLike communication",
      "commonwealthCommentId": 18070,
      "commonwealthName": "Monmore",
      "commonwealthPostedFromAddress": "0xc4Dc8BbC777213aAcb55015672EFfa4B1A56118e",
      "address": "0xc4Dc8BbC777213aAcb55015672EFfa4B1A56118e",
      "created_at": "2022-03-30T15:43:47.592Z",
      "ensName": null
    },
    {
      "plaintext": "Hey everyone,\n\nI am applying on behalf of StableNode .\n\nEthereum Address: 0x1D1a13b16667c284b87de62CAEEfF0ce89E342B2\n\nDiscord Handle: bobbay#4885\n\nTwitter Handle: StableNode\n\nStatement of Intention\n\nOur Head of Governance Stéphane, and I are currently leading the Governance Lab at StableNode to outline the best practices within decentralized governance.\n\nWe want to help facilitate discussions where we can identify the best practices and recognise how to tackle core problems within governance similar to the ones Element Finance aims to address such as plutocracy, voter apathy and lack of experimentation.\n\nAs StableNode members currently act as governance delegates across various protocols such as InstadApp, Klaytn and MakerDAO, we are looking forward to participating in Element Fi governance structure as a delegate and potentially on the GCS. We would focus on strategic initiatives and experimentation to tackle common governance problems such as plutocracy and voter apathy.\n\nWeb3 Qualifications / Skills\n\nOur founders are seasoned business development and growth professionals. They spent about three years growing the MakerDAO protocol in the European and Asian markets. They have an immense experience in creating growth in new markets and ensuring a sustainable strategy.\n\nOver the years, they have worked closely with Decentralized Finance, NFT projects, and thriving governance communities, especially MakerDAO. In all three fields, we have been present since the early days.\n\nHaving participated in the MakerDAO governance community for a long time, we have developed a systematic and robust approach to governance in decentralized networks. Creating principles that optimize the objective outcome of the decision-making process is key for successful governance.\n\nHere are a few key highlights of our success so far:\n\nSupported Klaytn and Polygon in accelerating the growth of their ecosystem\n\nRecognised Delegate at MakerDAO\n\nLead Governance Delegate at InstaDapp",
      "commonwealthCommentId": 18069,
      "commonwealthName": "Bobby | StableNode",
      "commonwealthPostedFromAddress": "0xc5deFE70073E5D3B609F2907683d9BEE0E9c6768",
      "address": "0x1D1a13b16667c284b87de62CAEEfF0ce89E342B2",
      "created_at": "2022-03-30T15:34:50.453Z",
      "ensName": null
    },
    {
      "plaintext": "Hey everyone,\n\nI am applying on behalf of StableNode .\n\nEthereum Address: 0x1D1a13b16667c284b87de62CAEEfF0ce89E342B2\n\nDiscord Handle: bobbay#4885\n\nTwitter Handle: StableNode\n\nStatement of Intention\n\nOur Head of Governance Stéphane, and I are currently leading the Governance Lab at StableNode to outline the best practices within decentralized governance.\n\nWe want to help facilitate discussions where we can identify the best practices and recognise how to tackle core problems within governance similar to ones Element Finance aims to address such as plutocracy, voter apathy and lack of experimentation.\n\nAs StableNode members currently act as governance delegates across various protocols such as InstadApp, Klaytn and MakerDAO, we are looking forward to participating in Element Fi governance structure as a delegate and potentially on the GCS. We would focus on strategic initiatives and experimentation to tackle common governance problems such as plutocracy and voter apathy.\n\nWeb3 Qualifications / Skills\n\nOur founders are seasoned business development and growth professionals. They spent about three years growing the MakerDAO protocol in the European and Asian markets. They have an immense experience in creating growth in new markets and ensuring a sustainable strategy.\n\nOver the years, they have worked closely with Decentralized Finance, NFT projects, and thriving governance communities, especially MakerDAO. In all three fields, we have been present since the early days.\n\nHaving participated in the MakerDAO governance community for a long time, we have developed a systematic and robust approach to governance in decentralized networks. Creating principles that optimize the objective outcome of the decision-making process is key for successful governance.\n\nHere are a few key highlights of our success so far:\n\nSupported Klaytn and Polygon in accelerating the growth of their ecosystem\n\nRecognised Delegate at MakerDAO\n\nLead Governance Delegate at InstaDapp",
      "commonwealthCommentId": 18067,
      "commonwealthName": "Bobby | StableNode",
      "commonwealthPostedFromAddress": "0xc5deFE70073E5D3B609F2907683d9BEE0E9c6768",
      "address": "0x1D1a13b16667c284b87de62CAEEfF0ce89E342B2",
      "created_at": "2022-03-30T15:29:43.603Z",
      "ensName": null
    },
    {
      "plaintext": "Happy to apply elementfi’s GSC!\n\nEthereum Address :\n\n0xe5b332c30db3a69eE4969328739DBF902FB7973C\n\nTwitter Handle: @StefanSara3\n\nStatement of Intention:\n\nAs the oldest crypto influencer in Korea, he runs a channel. We are also operating the Definalist rule, the first research dao in the Korean market.\n\nThe Korean market occupies a very large proportion of the global crypto market. I would like to participate in GSC as a council member representing the Korean market.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, Optimism&arbitrum, BSC, Heco, Polygon, Fantom, Solana, Terra and Cosmos(Secret network).\n\n- Nansen Alpha member.\n\n- Research, translation & Regional Commander at Riskharbor",
      "commonwealthCommentId": 18063,
      "commonwealthName": "973",
      "commonwealthPostedFromAddress": "0xe5b332c30db3a69eE4969328739DBF902FB7973C",
      "address": "0xe5b332c30db3a69eE4969328739DBF902FB7973C",
      "created_at": "2022-03-30T14:25:32.729Z",
      "ensName": null
    },
    {
      "plaintext": "Good day, here's my application for becoming a GSC delegate & candidate.\n\nI am from Switzerland\n\nDiscord Handle:  man2022#7370\n\nEthereum Address:  0xC6C34F9D6274003FD5C57E2CaC0491dd9F30b386\n\nTwitter Handle:  @CashAlina3\n\nStatement of Intention:\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, BSC, AVAX,STX,Polygon, Fantom, Solana, Terra and Cosmos.\n\n- Yield farming, trading, delta neutral.",
      "commonwealthCommentId": 18061,
      "commonwealthName": "吧86",
      "commonwealthPostedFromAddress": "0xC6C34F9D6274003FD5C57E2CaC0491dd9F30b386",
      "address": "0xC6C34F9D6274003FD5C57E2CaC0491dd9F30b386",
      "created_at": "2022-03-30T14:15:32.890Z",
      "ensName": null
    },
    {
      "plaintext": "Hello Element Community,\n\nI wish to become a delegate of Element Finance and take part into the decentralized governance.\n\nEthereum Address: 0x3066856Ed81B4F9C9C83F756c5a28c76bd8Ef4A3\n\nDiscord Handle: f4ge2#4057\n\nBeing an Element Finance protocol user, I firmly believe in that Element makes DeFi better and will devote myself to the great project.\n\nAs a delegate, I will take part into governance experimentation and protocol improvements. Further providing services and support to locals users merging into Element community.",
      "commonwealthCommentId": 18060,
      "commonwealthName": "a43",
      "commonwealthPostedFromAddress": "0x3066856Ed81B4F9C9C83F756c5a28c76bd8Ef4A3",
      "address": "0x3066856Ed81B4F9C9C83F756c5a28c76bd8Ef4A3",
      "created_at": "2022-03-30T14:06:31.438Z",
      "ensName": null
    },
    {
      "plaintext": "Hi everyone, I am very interested in this project and glad to have this opportunity to introduce myself and apply for a delegate\n\nEthereum Address: 0x5F82Bb7418cF3230f101a01b3F40F2113a5956Dd\n\nDiscord Handle: fs2022#4026\n\nTwitter Handle:  @Outfer2\n\nStatement of Intention:\n\nI am a front-end developer of a web3 company, and I am very interested in the blockchain industry and passionate about decentralization. Now I am participating in several DAO and working with community members to build the decentralized infrastructure for the future of our industry. I hope to work with this project to promote the development of decentralization.\n\nWeb3 Qualifications / Skills：\n\nI have 2 year front-end develop experience\n\nI was early member of DevDao and peopleDao\n\nI have participated in many defi、gamefi and NFT projects and provided some assistance to the project",
      "commonwealthCommentId": 18058,
      "commonwealthName": "6dd",
      "commonwealthPostedFromAddress": "0x5F82Bb7418cF3230f101a01b3F40F2113a5956Dd",
      "address": "0x5F82Bb7418cF3230f101a01b3F40F2113a5956Dd",
      "created_at": "2022-03-30T13:47:06.854Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address\n\n0x9b13Ebdaf067738c6b2476354EfB2cfE12d74F51\n\nDiscord Handle (optional)\n\nfstom#4115\n\nTwitter Handle (optional)\n\n@FletaPung\n\nStatement of Intention\n\nElement Finance was to us, a natural progression on how Defi was moving towards and there’s no better team working on building foundational building blocks for yield. Happy to be a part of the initiatives Element is pioneering particularly around the optimisitic grants and GSC",
      "commonwealthCommentId": 18057,
      "commonwealthName": "4f5",
      "commonwealthPostedFromAddress": "0x9b13Ebdaf067738c6b2476354EfB2cfE12d74F51",
      "address": "0x9b13Ebdaf067738c6b2476354EfB2cfE12d74F51",
      "created_at": "2022-03-30T13:33:48.794Z",
      "ensName": null
    },
    {
      "plaintext": "Good day, here's my application for becoming a GSC delegate & candidate.\n\nI am from Switzerland\n\nDiscord Handle:  mn365#6620\n\nEthereum Address:  0xc7c8e9003CE878c4011695C28a1A0E1Ee2Bb483D\n\nTwitter Handle:  @KaylaniGriffin\n\nStatement of Intention:\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally.\n\nTherefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, BSC, AVAX,STX,Polygon, Fantom, Solana, Terra and Cosmos.\n\n- Yield farming, trading, delta neutral.\n\n- Research & translation: Curvance",
      "commonwealthCommentId": 18055,
      "commonwealthName": "483",
      "commonwealthPostedFromAddress": "0xc7c8e9003CE878c4011695C28a1A0E1Ee2Bb483D",
      "address": "0xc7c8e9003CE878c4011695C28a1A0E1Ee2Bb483D",
      "created_at": "2022-03-30T12:48:44.893Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone, I’m very glad to have this opportunity to introduce myself to you here\n\nEthereum Address: 0x064A768BB4e79F22BA0Dcb3c5d2421ae32D51003\n\nDiscord Handle:  manhome#5944\n\nTwitter Handle:  @JaysonKnight12\n\nStatement of Intention:\n\nAs a blockchain developer, I have witnessed the revolution and development of the blockchain industry, more and more new things are building a more decentralized online world, It is a trend to redefine the original rights architecture in the form of Dao.\n\nIt was very meaningful for me to contribute early and grow with the community. Let’s push open the gate and step into the Elfiverse, shaping the future of Element.\n\nWeb3 Qualifications / Skills：\n\nI have 3 years of experience in blockchain development\n\nEarly tester of many web3 projects",
      "commonwealthCommentId": 18053,
      "commonwealthName": "1003",
      "commonwealthPostedFromAddress": "0x064A768BB4e79F22BA0Dcb3c5d2421ae32D51003",
      "address": "0x064A768BB4e79F22BA0Dcb3c5d2421ae32D51003",
      "created_at": "2022-03-30T12:31:39.826Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone,\n\nWould love to be involved in the Element Governance.\n\nI've been using the protocol since a few months, I'm reading a lot about FIRP and I'm a OG DeFi user (top 100 Degen-score in the world).\n\nEthereum Address : 0x7e0512f8089886003798cdeb60c898b145634bd3\n\nDiscord Handle : Leo5#5555\n\nTwitter Handle : @ leo5imon\n\nI really love Element Finance and would appreciate being involved into governance, mainly focused on Strategic Initiatives and Protocol improvements. I love how Element is innovating in terms of governance and brand image, I'd love to participate in forums, Discord discussions and protocol feedbacks.",
      "commonwealthCommentId": 18052,
      "commonwealthName": "Leo Simon",
      "commonwealthPostedFromAddress": "0x7E0512F8089886003798Cdeb60C898B145634BD3",
      "address": "0x7e0512f8089886003798cdeb60c898b145634bd3",
      "created_at": "2022-03-30T12:19:19.470Z",
      "ensName": "leosimon.eth"
    },
    {
      "plaintext": "Happy to apply elementfi’s GSC! Here's my application for being a GSC delegate & candidate.\n\nEthereum Address :\n\n0x3301E968c874F5c7Fc09D6BCf1055BA3eeB74749\n\nTwitter Handle: @pureK7302\n\ndiscord:pureblue984#0737\n\nStatement of Intention:\n\nAs the oldest crypto influencer in Korea, he runs a channel. We are also operating the Definalist rule, the first research dao in the Korean market.\n\nThe Korean market occupies a very large proportion of the global crypto market. I would like to participate in GSC as a council member representing the Korean market.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, Optimism&arbitrum, BSC, Heco, Polygon, Fantom, Solana, Terra and Cosmos(Secret network).\n\n- Research, translation & Regional Commander at Riskharbor",
      "commonwealthCommentId": 18049,
      "commonwealthName": "shaw",
      "commonwealthPostedFromAddress": "0x3301E968c874F5c7Fc09D6BCf1055BA3eeB74749",
      "address": "0x3301E968c874F5c7Fc09D6BCf1055BA3eeB74749",
      "created_at": "2022-03-30T10:38:39.525Z",
      "ensName": null
    },
    {
      "plaintext": "Hello Element Community, I am monkey, change agent and always happy to help!\n\nEthereum Address: 0x3b5Ae898D1146a6c6b29bdDb725Ab84F872c4980\n\nDiscord Handle: monkeyfse#1811\n\nTwitter Handle: @monkeyfse\n\nStatement of Intention: I intend to be a part of GSC to add valuable and strategic contributions and make ELF innovative governance and ecosystem efficient, reliable and sustainable via supporting and voting progressive proposals. I value simplicity, honesty, excellence, innovation, shared ideas, teamwork and decentralization.\n\nWeb3 Qualifications / Skills: First ENS reg. 2021, Market Research, Analytics, Money Management, Collaboration.\n\nDelegate Area: I desire to join Treasury Management and would appreciate your consideration and acceptance.\n\nThank you!",
      "commonwealthCommentId": 18045,
      "commonwealthName": "monkey",
      "commonwealthPostedFromAddress": "0x3b5Ae898D1146a6c6b29bdDb725Ab84F872c4980",
      "address": "0x3b5Ae898D1146a6c6b29bdDb725Ab84F872c4980",
      "created_at": "2022-03-30T09:01:03.610Z",
      "ensName": null
    },
    {
      "plaintext": "Putting forth a delegate proposal for myself here\n\nEthereum Address\n\n0x99bc02c239025e431d5741cc1dba8ce77fc51ce3\n\n(daryllau.eth)\n\nDiscord Handle (optional)\n\nDaryllautk#6303\n\nTwitter Handle (optional)\n\nDaryllautk https://twitter.com/daryllautk\n\nStatement of Intention\n\nWrote a short thread once on my tenets in life and how I try to live https://twitter.com/Daryllautk/status/1450124045157081102\n\nIt boiled down to really not being obsessed with money anymore and actively trying to make the world a better place by helping out projects/teams wherever I could.\n\nElement Finance was to us, a natural progression on how Defi was moving towards and there’s no better team working on building foundational building blocks for yield. Happy to be a part of the initiatives Element is pioneering particularly around the optimisitic grants and GSC\n\nWeb3 Qualifications / Skills (optional)\n\nI’ve been in the space since 2017, spearheaded getting DeFi on the map at CoinGecko for the better part of 2 years even before DeFi was the term we called it.\n\nAm on various multisigs such as Yearn.finance (was a part of the community since the beginning, leading some discussions on new token models and also helped contribute to Yearn tokenomics 2.0 https://gov.yearn.finance/t/yip-65-evolving-yfi-tokenomics/11994 posted last december) , the Curve.fi emergency multisig and PleasrDAO’s founding multisig\n\nShitposter on Twitter and have also been supporting the Element team with my brothers (not3lau capital) where we’ve done all sorts of things ranging from bootstrapping liquidity pools, tested products , memes and governance module feedback.\n\nWas previously leading Venture deals for Mechanism Capital where we invested in a variety of projects early and helped them out in any way we can ranging from token design, product strategy and liquidity.\n\nWhat I'm interested in\n\nTreasury management\n\n- Introductions to DAOs or even HNWIs who are looking for places to generate yields on their otherwise idle assets\n\nGovernance experimentation\n\n- Expanding upon my work and my experience with governance models and taking an active role in shaping Element Finance’s direction, either through establishing frameworks, leading initiatives or experimenting with proposals.\n\nProtocol improvements\n\n- While not techical, happy to bounce ideas off things that people are exploring, i see a wide variety of exposure to early stage to late stage projects that help give me a broader view of where the market is but also where it’s going\n\nAsset onboarding\n\n- Setting up introductions with Teams that could benefit from having fixed yield products built on top of them\n\nStrategic initiatives\n\n- Finding new products that could leverage Element or use element as an interface",
      "commonwealthCommentId": 18044,
      "commonwealthName": "Daryllautk",
      "commonwealthPostedFromAddress": "0x99BC02c239025E431D5741cC1DbA8CE77fc51CE3",
      "address": "0x99bc02c239025e431d5741cc1dba8ce77fc51ce3",
      "created_at": "2022-03-30T08:33:46.499Z",
      "ensName": null
    },
    {
      "plaintext": "Hello ! Glad to give my application to be a potential GSC representative and candidate.\n\nEthereum address: 0xB512f6eda8D66092C5ab1d6c5EC718970E064683\n\nTwitter handle: @dogss213\n\nDiscord handle: dogless#4165\n\nI was a marketing cousultant, but I hate the advertising rules and the related abuse on common users of media. When I found what blockchain can do, about 2years ago I knew this will change the whole world. People will retain their onwnership about their data, attentionment and money.\n\nHowever, we just come to the door of web3, and a lot of new changes we have to face. I spent most of my time in the last year to try new things on chain, DeFi protocals, NFTs, DAOs, so I know the difficult part of Web3 is collaboration in communities. While blockchain is believed to be a kind of trustless tech which is becoming the basic of Web3, we need even more trust and groupwork to build DAOs than ever, since people in collaboration creat value not anything else. Somneone call working in a DAO \"governing mining\", but I will prefer call it \"community building mining\".\n\nI have been trying to do this in some DAOs, like DODO exhange, Goldfinch Finance, Metamask Forum. I went to learn ,use, vote and discuss and give suggestions about the products and governance. I am also a user of Element Finance, so I am exciting to have a chance put my feet in this adventure. Governing in a new way is a creative try for DAOs and Element deserve respect. I will try to do my best in the community if I have get allowce to join the GSC.\n\nThanks.",
      "commonwealthCommentId": 18041,
      "commonwealthName": "dogless",
      "commonwealthPostedFromAddress": "0xB512f6eda8D66092C5ab1d6c5EC718970E064683",
      "address": "0xB512f6eda8D66092C5ab1d6c5EC718970E064683",
      "created_at": "2022-03-30T04:06:12.530Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone, I am a programmer working in an IT company for 10 years, good at product design, and software development, I like Element very much, and hope to participate in the next community building,I am very happy to apply for delegates & GSC Members.\n\nEthereum Address: 0xee85ab40aC1159A8700841e921b542d768265D4D\n\nDiscord Handle: Tmax#8276\n\nTwitter Handle: @tmacmax01",
      "commonwealthCommentId": 18038,
      "commonwealthName": "Tmax",
      "commonwealthPostedFromAddress": "0xee85ab40aC1159A8700841e921b542d768265D4D",
      "address": "0xee85ab40aC1159A8700841e921b542d768265D4D",
      "created_at": "2022-03-30T01:39:44.092Z",
      "ensName": "tmacmax.eth"
    },
    {
      "plaintext": "Hello everyone, I read everyone's introduction carefully, I think everyone is amazing, I am very happy to be in such a passionate and active community, and I want to work harder to become an Element governance delegate and a potential member of the GSC.\n\nEthereum Address:0x4F27Ee7aD5eF8d881f62511A36a245E99eAed800\n\nDiscord Handle:Willance#2555\n\nTwitter Handle:@BlueberryBBY3\n\nStatement of Intention:fair and transparent！\n\nWeb3 Qualifications / Skills:\n\nI am deeply involved in a series of web3 projects such as galaxy project, rabbit hole, ens, showme, cybercrypto, etc. I am a volunteer in the community, as well as a builder and evangelist. As a KOL in the Chinese area, I operate the Chinese social media weibo and have 8,000 fans. I can do my best in project promotion and introduction.",
      "commonwealthCommentId": 18022,
      "commonwealthName": "Willance",
      "commonwealthPostedFromAddress": "0x4F27Ee7aD5eF8d881f62511A36a245E99eAed800",
      "address": "0x4F27Ee7aD5eF8d881f62511A36a245E99eAed800",
      "created_at": "2022-03-29T19:12:43.627Z",
      "ensName": "willance.eth"
    },
    {
      "plaintext": "Greetings Elves!\n\nI'm Kianga Daverington , former derivatives and commodities trading attorney turned Founder of Acre of America, an impact investment firm working at the intersection of new technologies & rural problems.\n\nACREinvest is our new blockchain venture focused on Web3 governance services and social incentives for DAOs and tokenized communities. We recently launched ACRE DAOs , a tokenized community passionate about regenerative finance (ReFi) and using crypto asset investing for positive IRL impact.\n\nEthereum Address : acreinvest.eth | 0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D\n\nDiscord Handle : ACREinvest#2401\n\nTwitter Handle : Firm @acreinvest | Personal @ fhomoney\n\nStatement of Intention:\n\nSupport Element Finance DAO achieve its goals of distinction and innovation in decentralized finance through Delegate services in the mode of a neutral judiciary.\n\nI'd like to be a delegate and a GSC member because new financial product innovation and regulatory policy in markets have long been a hallmark of my work and professional fascination. Today there are greater imperatives at stake than intellectual stimulation and financial reward. These existential concerns drive my preoccupation to infuse DeFi with regenerative economy principles, but without sacrificing free-market structures and permissionless innovation.\n\nWeb3 Qualifications / Skills:\n\nI currently serve as a Recognized Delegate for MakerDAO , am Founder of an impact investment club DAO community (ACRE DAOs) and I'm active in other Web3 DAOs including Seed Club and Forefront.\n\nProfessionally I have worked in crypto since 2017 - initially I joined a start-up crypto asset manager as Legal Counsel and Operations Manager before founding Acre of America in 2018.\n\nI began my legal career in the late 1990s as a Corporate Associate in the derivatives practice group at Cravath, Swaine & Moore LLP in New York City after graduating from Spelman College and the Yale Law School. Clients included the International Swaps and Derivatives Association (“ISDA”) and as ISDA’s U.S. Outside Counsel I coordinated the work of several sell-side working groups that published documentation and resolved legal, commercial, regulatory and operational issues facing derivatives markets, including for the then-emerging credit derivatives market and launch of the Euro.\n\nIn later roles I gained extensive deal and transactional experience supporting the fixed-income derivatives, currencies/FX, derivatives prime brokerage and energy trading businesses at Goldman Sachs; derivatives and physical commodities trading at Lehman Brothers; and global commodities merchant trading businesses at Castleton Commodities International.\n\nDelegate Focus:\n\nI have particular interest in focusing on:\n\nGovernance experimentation\n\nStrategic initiatives\n\nThank you for your consideration!\n\nKianga",
      "commonwealthCommentId": 18018,
      "commonwealthName": "ACREinvest",
      "commonwealthPostedFromAddress": "0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D",
      "address": "0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D",
      "created_at": "2022-03-29T19:00:21.907Z",
      "ensName": "acreinvest.eth"
    },
    {
      "plaintext": "Ethereum Address: 0x1824BEFc17aedBC57991C9D7c7Fee1bf18CCCe63\n\nDiscord Handle: cat5token#8683\n\nTwitter Handle: @catdefi\n\nStatement of Intent:\n\nDAO governance will become an important organizational form in the future, but the openness and transparency of DAO will bring us closer together and become stronger. Aspires to be the DAO representative of Element and grow with Element.",
      "commonwealthCommentId": 18010,
      "commonwealthName": "catbaby",
      "commonwealthPostedFromAddress": "0x1824BEFc17aedBC57991C9D7c7Fee1bf18CCCe63",
      "address": "0x1824BEFc17aedBC57991C9D7c7Fee1bf18CCCe63",
      "created_at": "2022-03-29T17:14:25.319Z",
      "ensName": "comeonhoney.eth"
    },
    {
      "plaintext": "Hi! Element Community. I am very glad to participate in this selection and hope to be honored to join the governance committee.\n\nEthereum Address： 0x721C7ffFe9aC426A028e616677811F755Fa99EbA\n\nDiscord Handle： Degg-Dengdeng (∞,∞)#1455\n\nTwitter Handle： @JiangTrader\n\nVISION： Normative, fair and representative of the will of the majority\n\nStatement of Intention:\n\nI am co-founder of BigplayerDAO.\n\nWhat really separates DAO from traditional organizations such as companies, guilds, associations, etc. is not the organizational vision or goal of these subdivisions. It's not that we have some imagination or unrealistic desire for the world, but how to form an effective interaction with the traditional world under a reasonable legal framework, how to design the reasonable decision-making system of Everyone matters, and how to regulate its ownership and governance - I We are in the stage of eternal explorers.\n\nShakespeare has a beautiful sentence in the comedy The Merry Wives of Windsor called The world is my oyste, which probably says: Whatever you want, the world is my stage.\n\nSo I like traveling in the world of web3 very much. I hope to participate in the governance of Element to help the development of communities and projects.",
      "commonwealthCommentId": 18009,
      "commonwealthName": "Lory Jay",
      "commonwealthPostedFromAddress": "0x721C7ffFe9aC426A028e616677811F755Fa99EbA",
      "address": "0x721C7ffFe9aC426A028e616677811F755Fa99EbA",
      "created_at": "2022-03-29T17:04:48.435Z",
      "ensName": "wgminterface.eth"
    },
    {
      "plaintext": "Hi Element Community.I am very glad to participate in this selection and hope to be honored to join the governance committee.\n\nEthereum Address: 0x62D1556564Aca67d7F92c61e1946a02d83255Cb2\n\nDiscord Handle moonedge#8579\n\nTwitter Handle @metadevdao\n\nVISION： fair && transparent && more open connected with people all over the world\n\nMy web3 qualifications / skills：I am one of the most active member of robotdao community. I focus on finding early projects and helping them grow fast and get enough test feedback. Promoting projects is our specialty. I pay attention to element for one year and hope to have the opportunity to participate in governance. Besides, i am good at marketing and teaching, give community members comprehensive understanding of the function, vision and roadmap of the projects.",
      "commonwealthCommentId": 18007,
      "commonwealthName": "metawoman",
      "commonwealthPostedFromAddress": "0x62D1556564Aca67d7F92c61e1946a02d83255Cb2",
      "address": "0x62D1556564Aca67d7F92c61e1946a02d83255Cb2",
      "created_at": "2022-03-29T15:46:39.262Z",
      "ensName": "metawoman.eth"
    },
    {
      "plaintext": "Dear Element FI,\n\nI am very happy to apply for delegates & GSC Members.\n\nEthereum Address: 0x53e67d66a2615DC46C746A5405004D534cdb02BD\n\nStatement of Intention:\n\n I am a bit hungry to be a GSC representative and candidate.\n\nthanks!",
      "commonwealthCommentId": 18004,
      "commonwealthName": "Tom",
      "commonwealthPostedFromAddress": "0x53e67d66a2615DC46C746A5405004D534cdb02BD",
      "address": "0x53e67d66a2615DC46C746A5405004D534cdb02BD",
      "created_at": "2022-03-29T15:23:00.296Z",
      "ensName": null
    },
    {
      "plaintext": "Dear all, Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xbEe6F8C81CAE65CD2100302bA40f8566383098d1\n\nDiscord Handle: kevinlyl#5202\n\nTwitter @kevinlyl2\n\nStatement of Intention:  DAO governance will be an important organizational form in the future, As a blockchain enthusiast, I like to participate in various DAO governance. I am very interested in the development of Element and would like to become a governance representative.",
      "commonwealthCommentId": 18003,
      "commonwealthName": "kevin",
      "commonwealthPostedFromAddress": "0xbEe6F8C81CAE65CD2100302bA40f8566383098d1",
      "address": "0xbEe6F8C81CAE65CD2100302bA40f8566383098d1",
      "created_at": "2022-03-29T15:16:05.648Z",
      "ensName": "mxcpro.eth"
    },
    {
      "plaintext": "Ethereum Address:  0x7a93750aFdFcc232050C8a5A8e26e29F2f3D0840\n\nDiscord Handle:  billylyl#2837\n\nTwitter Handle:\n\n@billylyl\n\nStatement of Intention\n\nit would be a big honor to become a member of the governance committee, i would like to share Element FI to my new and old friends.",
      "commonwealthCommentId": 18002,
      "commonwealthName": "billy",
      "commonwealthPostedFromAddress": "0x7a93750aFdFcc232050C8a5A8e26e29F2f3D0840",
      "address": "0x7a93750aFdFcc232050C8a5A8e26e29F2f3D0840",
      "created_at": "2022-03-29T15:05:27.054Z",
      "ensName": "sonala.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xdF4f0Ad809b9476FB90475F728aF100dEF5E9678\n\nDiscord Handle: bitbug#1760\n\nTwitter @PandaCapital_io\n\nStatement of Intention:\n\nPanda Capital is a well-known investment capital in China focusing on Blockchain and Cryptocurrency investment. We have successively discovered and invested a lot of Blockchain projects.\n\nPanda Capital is a research & community driven venture capital focusing on investments in infrastructure, middleware, DeFi and other Web 3.0 applications.\n\nPanda is a decentralized organization, we have gathered talents from all walks of life.\n\nWe invested in many great projects and are actively involved in the various developer & DAO communities.\n\nDAO governance will be an important organizational form in the future, especially in the field of decentralization. We want to be partner with Element Finance.\n\nWebsite:https://www.pandacapital.io/\n\nTwitter:https://twitter.com/PandaCapital_io",
      "commonwealthCommentId": 18000,
      "commonwealthName": "Bitbug",
      "commonwealthPostedFromAddress": "0xdF4f0Ad809b9476FB90475F728aF100dEF5E9678",
      "address": "0xdF4f0Ad809b9476FB90475F728aF100dEF5E9678",
      "created_at": "2022-03-29T15:01:56.095Z",
      "ensName": null
    },
    {
      "plaintext": "Hi Element Community. Let me present my self for the call for Delegates & GSC Members.\n\nEthereum Address: 0xba07e5cb42cA05D2fc3D96514461D7245050eb7B\n\nDiscord Handle rochestor#1448\n\nTwitter Handle @rochestor_mu\n\nVISION：freedom && peace && fair && transparent\n\nMy web3 qualifications / skills：I am one of the most active member of robotdao community. I focus on finding early projects and helping them grow fast and get enough test. Promoting projects is our specialty. I pay attention to element for one year and hope to have the opportunity to participate in governance.",
      "commonwealthCommentId": 17999,
      "commonwealthName": "rochestor",
      "commonwealthPostedFromAddress": "0xba07e5cb42cA05D2fc3D96514461D7245050eb7B",
      "address": "0xba07e5cb42cA05D2fc3D96514461D7245050eb7B",
      "created_at": "2022-03-29T14:55:20.222Z",
      "ensName": "greennft.eth"
    },
    {
      "plaintext": "Ethereum Address: 0xc58D054217281e665412C45271319Bf951f4FB2c\n\nDiscord Handle: moyu#1287\n\nTwitter Handle: @moyu1608\n\nStatement of Intent:\n\nAs a blockchain enthusiast, I like to participate in various DAO governance. DAO governance can make the project develop better. I have been using Element finance for more than 200 days, he is a very safe, reliable and excellent defi project, so I am very eager to be a potential GSC representative and candidate. Bless Element finance!",
      "commonwealthCommentId": 17996,
      "commonwealthName": "nftstaker",
      "commonwealthPostedFromAddress": "0xc58D054217281e665412C45271319Bf951f4FB2c",
      "address": "0xc58D054217281e665412C45271319Bf951f4FB2c",
      "created_at": "2022-03-29T14:46:07.135Z",
      "ensName": "nftstaker.eth"
    },
    {
      "plaintext": "Hey bros! I want to be a governance representative.\n\nEthereum Address: 0x43d6703D429013691B59cDc0196627BA10594B4d\n\nDiscord Handle: 17811889809#3020\n\nStatement of Intention\n\nI love Element! The benefits of a fixed rate protocol give me peace of mind. I am a solid investor and I believe that if I can use it together with other protocols, my return can be more and my capital utilization will be higher. So I am very interested in the development of Element and would like to become a governance representative.\n\nWeb3 Qualifications / Skills\n\nKnow and use many fixed rate protocols like Anchor,Swivel\n\nFrequent use of Snapshot,Poap\n\nDefi old player\n\nI wanna focus on Governance experimentation and wish I can have such an opportunity.",
      "commonwealthCommentId": 17992,
      "commonwealthName": "Fishleong",
      "commonwealthPostedFromAddress": "0x43d6703D429013691B59cDc0196627BA10594B4d",
      "address": "0x43d6703D429013691B59cDc0196627BA10594B4d",
      "created_at": "2022-03-29T14:21:04.966Z",
      "ensName": "fishleong.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address:0x5a81868992Ffcf4200A85972c60151690Af39006\n\nDiscord handle:awakening#6723\n\nStatement of Intention: Principles, friendliness, cooperation\n\nWeb3 Qualifications / Skills :Here's an article on my rabbithole project\n\nhttps://mirror.xyz/%E5%AE%8C%E7%BE%8E%E7%9A%84%E4%B8%96%E7%95%8C.eth/5X1Fk deJrCDjZkMUbKDadXOCan6l0JI5Y8A gBezoo",
      "commonwealthCommentId": 17989,
      "commonwealthName": "awakening",
      "commonwealthPostedFromAddress": "0x5a81868992Ffcf4200A85972c60151690Af39006",
      "address": "0x5a81868992Ffcf4200A85972c60151690Af39006",
      "created_at": "2022-03-29T13:56:27.380Z",
      "ensName": "完美的世界.eth"
    },
    {
      "plaintext": "Hello everybody I am interested in community governance and aspire to be a GSC member~\n\nEthereum Address:0x7A8520c1aB4be954a779432F76eFCbc927c5Bcb4\n\nDiscord Handle:EL#1744\n\nStatement of Intention\n\nI enjoy using different ethereum protocols and participated in a lot of DAO governance.After using Element, it was a great experience for me. I started to get interested in fixed rate protocols. If I can become a GSC member, I can understand the project better and share it to my friends.\n\nWeb3 Qualifications / Skills (optional)\n\nCreated a space on Snapsho t and participated in the poll\n\nParticipate in Dydx early community governance\n\nEnjoy attending conferences and collecting Poap\n\nObtained the Rabbithole badge\n\nTried many Interesting protocols on Ether,such as Superfluid,Gearbox,Fractional.etc\n\nPassionate about Dao governance like Aladdin Dao,Open Dao etc.\n\nI would like to focus on Governance experimentation and wish Element go to the moon!",
      "commonwealthCommentId": 17987,
      "commonwealthName": "Salt",
      "commonwealthPostedFromAddress": "0x7A8520c1aB4be954a779432F76eFCbc927c5Bcb4",
      "address": "0x7A8520c1aB4be954a779432F76eFCbc927c5Bcb4",
      "created_at": "2022-03-29T13:37:37.720Z",
      "ensName": "darryring.eth"
    },
    {
      "plaintext": "Hello ,I hope join the party.\n\nEthereum Address:0xa1b5aF8Eccc097FAc2a68F878754Aa8202092Bab\n\nDiscord handle:cwxg#2033\n\nTwitter Handle:@manhome2021\n\nI am ambassador of MakerDAO, and participating actively in communities like Balancer, Enzyme, Superfluid, or Potion Finance.\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has.",
      "commonwealthCommentId": 17982,
      "commonwealthName": "manhome",
      "commonwealthPostedFromAddress": "0xa1b5aF8Eccc097FAc2a68F878754Aa8202092Bab",
      "address": "0xa1b5aF8Eccc097FAc2a68F878754Aa8202092Bab",
      "created_at": "2022-03-29T12:48:27.655Z",
      "ensName": "jeepgladiator.eth"
    },
    {
      "plaintext": "Hi Element Community. Let me present my self for the call for Delegates & GSC Members.\n\nEthereum Address: 0xe2827A84D17FA2FAF954708981F6722F43Cd0454\n\nDiscord Handle huangnanlv#3205\n\nTwitter Handle @huangnanlv\n\nVISION：Fair transparent\n\nMy web3 qualifications / skills：I am the co-founder of robotdao and bigplayerdao. I focus on finding early projects and helping them grow together. Promoting projects is our specialty. I pay attention to element for one year and hope to have the opportunity to participate in governance",
      "commonwealthCommentId": 17981,
      "commonwealthName": "huangnanlv",
      "commonwealthPostedFromAddress": "0xe2827A84D17FA2FAF954708981F6722F43Cd0454",
      "address": "0xe2827A84D17FA2FAF954708981F6722F43Cd0454",
      "created_at": "2022-03-29T12:45:58.847Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone,\n\nEthereum Address:0x4226f83B6761fe3259505A5edf31aE4657582d15\n\nDiscord handle:loveday#3831\n\nTwitter Handle:@tixiaoyu1220\n\nStatement of Intention:I am very strong in execution, patient and like to learn. I would like to apply for discord staff, if needed, I can be online 24 hours a day, absolutely obey the requirements of the project and work",
      "commonwealthCommentId": 17979,
      "commonwealthName": "December",
      "commonwealthPostedFromAddress": "0x4226f83B6761fe3259505A5edf31aE4657582d15",
      "address": "0x4226f83B6761fe3259505A5edf31aE4657582d15",
      "created_at": "2022-03-29T12:15:54.040Z",
      "ensName": "chuxuan.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address:0xD2aBD7a3333395a1ed7E54C67eDF43ef934033A1\n\nDiscord handle:poakdoi#4319\n\nTwitter Handle:@great_token\n\nStatement of Intention:\n\nValues: Courage to innovate, actively cooperate to create a better future\n\nMy web3 qualifications / skills:As a network engineer and Internet illustrator of \"Weimeng\", a subsidiary of Tencent, he has helped Square DAO to create NFT",
      "commonwealthCommentId": 17975,
      "commonwealthName": "great_token",
      "commonwealthPostedFromAddress": "0xD2aBD7a3333395a1ed7E54C67eDF43ef934033A1",
      "address": "0xD2aBD7a3333395a1ed7E54C67eDF43ef934033A1",
      "created_at": "2022-03-29T11:25:58.764Z",
      "ensName": "binancetuzi.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x1702Bf1d68805518f972b1ba06Ce50C000b06b7B\n\nDiscord Handle: csc#6046\n\nTwitter @csctony55\n\nStatement of Intention:\n\nValues:\n\n Decentralization, Over-Communication, Community Inclusivity.\n\nVision:\n\nThe DNA of blockchain is decentralization, transparency and fairness. Nowadays, many traditional Internet giants control the public opinion and data of the whole world. They started with revolutionary authority but eventually turned into dragons. web3.0 is another revolution against these evil dragons, and DAO is a powerful tool for the revolution. my goal is to be a true community representative/steward that directly responds and leads the community to explore more democratic financial inclusion in a decentralized manner.\n\nReason why I want to become a delegate/GSC Member:\n\nIn my opinion, Element Finance is one of the indispensable tools in DeFi \"money lego\" and I hope to be able to participate in this excellent project and contribute value to the project and community governance.\n\nWeb3 Qualifications / Skills:\n\nActive contributor in the following DAOs/Communities:\n\nUniswap\n\nSwivel\n\nSense\n\nCowswap\n\nFurucombo\n\nCo-founder of FunChain Technology in HongKong\n\nThanks for your time, and looking forward to help in this amazing project.",
      "commonwealthCommentId": 17970,
      "commonwealthName": "csc",
      "commonwealthPostedFromAddress": "0x1702Bf1d68805518f972b1ba06Ce50C000b06b7B",
      "address": "0x1702Bf1d68805518f972b1ba06Ce50C000b06b7B",
      "created_at": "2022-03-29T09:51:00.471Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xEDB7AF625443Bec75d53544e091Ee3492ede8BC2\n\nDiscord handle:NightLeo#8525\n\nTwitter Handle:@lwy183\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nMy web3 qualifications / skills:\n\nI am a freelancer who has focused on exploration in the Crypto/DeFi/Web3 field for the past 3 years and actively participated in communities such as Balancer, Dydx, Ens, Bico and Potion Finance.\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has. One thing is for certain, the future is incredibly bright for both Element Fi and DeFi Governance!",
      "commonwealthCommentId": 17964,
      "commonwealthName": "NightLeo",
      "commonwealthPostedFromAddress": "0xEDB7AF625443Bec75d53544e091Ee3492ede8BC2",
      "address": "0xEDB7AF625443Bec75d53544e091Ee3492ede8BC2",
      "created_at": "2022-03-29T08:23:13.639Z",
      "ensName": "safepaypal.eth"
    },
    {
      "plaintext": "Ethereum Address: 0xCb84245288B62ff5693d1557d253845dA4f9f28D\n\nDiscord Handle: Guillermina#7065\n\nTwitter Handle: @Guiller40018941\n\nStatement of Intention:\n\nAs the crypto world becomes more influential, more traditional industries will enter the crypto space, I think Element Finance is an excellent protocol to promote the prosperity of crypto, so I am honored to take this opportunity to nominate as a governance delegate.I am willing to give all of my efforts to tackle some of the critical challenges in the governance space and push forward the Element Protocol!\n\nWeb3 Qualifications / Skills:\n\nActively participate in a variety of ecosystems：ETH, Polygon, Fantom,Avax,BSC, Solana, Terra and Cosmos.\n\nGitcoin Donors\n\nWeb3 activity like RSS3,EthSign,Ens,Cryberconnect,Build space,Galaxy ID,Third web.\n\nParticipate in early testing of multiple projects and provide feedback",
      "commonwealthCommentId": 17963,
      "commonwealthName": "Guiller40018941",
      "commonwealthPostedFromAddress": "0xCb84245288B62ff5693d1557d253845dA4f9f28D",
      "address": "0xCb84245288B62ff5693d1557d253845dA4f9f28D",
      "created_at": "2022-03-29T08:08:39.137Z",
      "ensName": "ted01.eth"
    },
    {
      "plaintext": "Hi, Dear Element Community, I am Jingwei (Kingway, only because it’s easier for friends’ pronunciation), here is my application\n\nEthereum Address : 0x17dfD18987B6B131686fea478600b75D11193335\n\nDiscord Handle : JingweiZou#3892\n\nTwitter Handle : @zoujw\n\nStatement of Intention\n\nValue: Fair, open, reliable, and as an ancient saying goes “If poor, stick to own virtue in solitude; if wealthy, make the whole world better as well.”\n\nMission and Vision: Devoted to a better world, Let's make Element a great project.\n\nReasoning behind why I want to be a delegate and/or a GSC member.\n\nWith 15 years working in the energy industry, I have extensive experience in large-scale projects and company operations from downstream, midstream to upstream, which is rare in that industry and no doubt a valuable asset. But I quit in the end of 2020, when the upstream oil price plummeted, the centralizated world played the tricky game again, mergers and the economic restructuring afterwards. I knew about the blockchain a few years ago but I stood outside the threshold until I quit my previous industry, God opened a new door for me, and from 2021, I became an enthusiast in this emerging industry and enjoyed this journey very much. I call it:\n\nMy journey in the centralized world is over and my journey in the decentralized world has just begun.\n\nIt has been around half a year since I became an Element protocol user, Usually, “participate in the protocol, join the community, and if any idea comes up, contribute to the community” is how I participate in the protocols, and I am also rewarded, sometimes even big surprise. And I have a strong sense of joy when I see my friends get rewarded because of my sharing.\n\nI usually don’t raise my hand to talk, as I was taught from very young age and my previous industry experience to listen, think and talk less, even I had a western education. But when I feel I am needed, I stand out.\n\nOver the past year, I’ve attended a large number of POAP recorded events, I never appeared on the stage, I guess the POAP team used to think I was a “farmer”. I was a Top 2 POAP collector in the world for a period of time. The journey with POAP and Gitcoin and other eth-core project benefited me, unlike some friends who I ever came into contact, who had been immersed in altcoin trading since their entering this industry and most of them gained nothing and some even lost money. But I got to the real decentralized world.\n\nI read all the words above for application, the “An introduction to Element’s Governance Model”, and watched the video, I have to admit that I was inspired. I now want to go a step further to dive deeper, to learn, and build with you.\n\nI believe the journey has just begun and we will bring more to each other so there will be a better world, a better Element and us in the future. Thank you all.\n\nWeb3 Qualifications / Skills (optional)\n\n·      Proactive participants for almost all the existing and emerging chains and protocols\n\n·      Early passionate participants and early governance participants for the influential projects such as: Uniswap/dYdX/ENS/Sushiswap/Paraswap/Cowswap/Gearbox/RSS3/Balancer/AAVE, Cosmos and etc.\n\n·      RabbitHole Level 6 Adventure Badge holder\n\n·      Web3 Project Galaxy Meta Cowboy: Revolution, Dr.SOL, Galaxy Girl and Reindeer NFT holder\n\n·      ETHrank score: 710\n\n·      High Activity donor to Gitcoin\n\n·      Bankless/Coingecko/Earnifi member…\n\nWhat areas you would like to focus on as a delegate, such as (but not limited to):\n\nActually, I am interested in all the 5, but my first step would be to focus on Governance experimentation.\n\nThank you for your time, no matter my application will be accepted or not, I shall feel happy on my today’s move.",
      "commonwealthCommentId": 17962,
      "commonwealthName": "kingway",
      "commonwealthPostedFromAddress": "0x17dfD18987B6B131686fea478600b75D11193335",
      "address": "0x17dfD18987B6B131686fea478600b75D11193335",
      "created_at": "2022-03-29T07:56:18.415Z",
      "ensName": "kingway.eth"
    },
    {
      "plaintext": "Discord Handle:  fage04#8139\n\nEthereum Address:  0xf85307307c372f148375Eb6f570aedF230f9fDc8\n\nTwitter Handle:  @Q6iUIVb1bXXpm10\n\nStatement of Intention:\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally.\n\nTherefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, BSC, AVAX,STX,Polygon, Fantom, Solana, Terra and Cosmos.\n\n- Yield farming, trading, delta neutral.\n\n- Research & translation: Curvance",
      "commonwealthCommentId": 17958,
      "commonwealthName": "fage",
      "commonwealthPostedFromAddress": "0xC120A4E2C40D0A63319EE18912e008d727349d62",
      "address": "0xf85307307c372f148375Eb6f570aedF230f9fDc8",
      "created_at": "2022-03-29T07:02:41.572Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow it as my application to be a potential GSC representative and candidate.\n\nEthereum address: 0x541FFD67537185Cb4ABC2b028795C2Bf4AC6C45f\n\nDiscord handle: tanqiwei#6666\n\nTwitter handle: @tanqiwei3\n\nStatement of Intent:\n\nValues: freedom, equality, tolerance, openness and transparency, decentralization! ......\n\nMy web3 qualifications/skills:\n\nI am a blockchain enthusiast and a college student. I have been studying and working in the crypto industry for over 2 years. I have experienced many products through interactive testing. I am a loyal user and investor of many products and I am still promoting it. Ambassador, I often help promote products. After all, my college classmates are also very interested in blockchain~. I am delighted to see the deployment of Element Finance governance, looking forward to its future and wishing the project success.",
      "commonwealthCommentId": 17957,
      "commonwealthName": "tanqiwei",
      "commonwealthPostedFromAddress": "0x541FFD67537185Cb4ABC2b028795C2Bf4AC6C45f",
      "address": "0x541FFD67537185Cb4ABC2b028795C2Bf4AC6C45f",
      "created_at": "2022-03-29T06:42:54.216Z",
      "ensName": "tanqiwei.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xE34e61D1EC3De092eAC80983fC6480a57dBA1CD7\n\nDiscord Handle: Water#8288\n\nTwitter Handle: @wufeife97376315\n\nValues:Democratic Governance， equality，Open, Positive\n\n I am a newly graduated college student, I came into contact with blockchain when I was in college. And especially loves this industry, Participated in DEFI in the early days, Is an early user of UNI, Now he is a blockchain practitioner, Usually active in various public chain ecology, Such as ETH, SOL, COSMOS, Terra, AVAX and so on, This year, I focused on Layer2, Cross-chain bridges, Web 3.0, and DAO, I also like to collect NFT at ordinary times. I think I will share some experience with Element Community about DAO construction. I usually have plenty of time to participate in community building, I also have some professional blockchain players around me. Although they can't compare with geeks, they all have rich experience. I think I will share Element Community with them. Element Finance itself is a high degree of community autonomy, which is also an important reason why I am willing to participate. I hope to see more talents participate and make the community develop better and faster. I hope the official can see my application!",
      "commonwealthCommentId": 17956,
      "commonwealthName": "water",
      "commonwealthPostedFromAddress": "0xE34e61D1EC3De092eAC80983fC6480a57dBA1CD7",
      "address": "0xE34e61D1EC3De092eAC80983fC6480a57dBA1CD7",
      "created_at": "2022-03-29T06:33:06.538Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow it as my application to be a potential GSC representative and candidate.\n\nEthereum address: 0x7a9cdb033ccA7D24f48ed79242986ef2ea0cF4Db\n\nDiscord handle: zdh19875926656#9252\n\nTwitter handle: @QianMo85229356\n\nStatement of Intent:\n\nValues: freedom, equality, tolerance, openness and transparency, decentralization! ......\n\nMy web3 qualifications/skills:\n\nI am a blockchain enthusiast and a college student. I have been studying and working in the crypto industry for over 2 years. I have experienced many products through interactive testing. I am a loyal user and investor of many products and I am still promoting it. Ambassador, I often help promote products. After all, my college classmates are also very interested in blockchain~. I am delighted to see the deployment of Element Finance governance, looking forward to its future and wishing the project success.",
      "commonwealthCommentId": 17954,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x7a9cdb033ccA7D24f48ed79242986ef2ea0cF4Db",
      "address": "0x7a9cdb033ccA7D24f48ed79242986ef2ea0cF4Db",
      "created_at": "2022-03-29T05:52:06.952Z",
      "ensName": "v-eth666.eth"
    },
    {
      "plaintext": "Hello everyone! Allow me to introduce myself for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x709680F22D2B95267764db0e1385B59525d7f4D8\n\nDiscord Handle: lsfyyds#9843\n\nTwitter Handle: @shifeili0003\n\nStatement of Intention:\n\nValues: Transparency, Cooperation, sharing, democratic governance\n\nAs an Element experiencer, I will serve community users and educate early adopters while participating in governance. I will also participate in governance experiments and protocol improvements.",
      "commonwealthCommentId": 17951,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x709680F22D2B95267764db0e1385B59525d7f4D8",
      "address": "0x709680F22D2B95267764db0e1385B59525d7f4D8",
      "created_at": "2022-03-29T05:16:39.422Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address:0xd7F68580B8071871723A7e201Bd1A109688185Da\n\nDiscord handle: guancc2021#8835\n\nTwitter Handle: @guancc2021\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has. One thing is for certain, the future is incredibly bright for both Element Fi and DeFi Governance!",
      "commonwealthCommentId": 17949,
      "commonwealthName": "guancc2021",
      "commonwealthPostedFromAddress": "0xd7F68580B8071871723A7e201Bd1A109688185Da",
      "address": "0xd7F68580B8071871723A7e201Bd1A109688185Da",
      "created_at": "2022-03-29T05:06:26.315Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow me to introduce myself for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xC43E3Fb4B66274Af1cb583Ff0dDeD4B1A3B4049B\n\nDiscord Handle: Lsf#7865\n\nTwitter Handle: @mECjHSalVV4QuJI\n\nStatement of Intention:\n\nValues: Transparency, Community Inclusivity, Cooperation, sharing, democratic governance\n\nI'm excited to see the deployment of Element Finance's Governance, Element is a very good Defi financial system. As an Element experiencer, I will serve community users and educate early adopters while participating in governance. I will also participate in governance experiments and protocol improvements.\n\nMy web3 qualifications/skills.\n\nI am focused on the promotion of the web3 educational community. Outreach has been done in the Chinese community.\n\n0",
      "commonwealthCommentId": 17946,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0xC43E3Fb4B66274Af1cb583Ff0dDeD4B1A3B4049B",
      "address": "0xC43E3Fb4B66274Af1cb583Ff0dDeD4B1A3B4049B",
      "created_at": "2022-03-29T04:56:31.698Z",
      "ensName": "bitcoinyyds.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xFaf6bb8F1a300130fB9dc582DC8363a50841882D\n\nDiscord handle: cunha#0897\n\nTwitter Handle:@sjx198143\n\n I'm from China. I'm a student about to graduate from university. I'm honored to be the members of element. I am currently working as an intern in a blockchain company. I have nearly two years of experience in the field of encryption. I have worked as an ambassador in several defi protocols, such as synfutures firefly and Tempus. I have experience in managing the community, and I have good English. I can do some translation work for the community and bring new information to Chinese users in time. I like to experience new products and am happy to test our new products and provide my own feedback.",
      "commonwealthCommentId": 17945,
      "commonwealthName": "arno",
      "commonwealthPostedFromAddress": "0xFaf6bb8F1a300130fB9dc582DC8363a50841882D",
      "address": "0xFaf6bb8F1a300130fB9dc582DC8363a50841882D",
      "created_at": "2022-03-29T04:46:00.615Z",
      "ensName": "bnb666.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address:0xb38544cCf295D78B7AE7b2baE5dbEbDB1f09910D\n\nDiscord handle: 凉粉小刀#5161\n\nTwitter Handle:@liangfenxiadoao\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has. One thing is for certain, the future is incredibly bright for both Element Fi and DeFi Governance!",
      "commonwealthCommentId": 17943,
      "commonwealthName": "liangfenxiaodao",
      "commonwealthPostedFromAddress": "0xb38544cCf295D78B7AE7b2baE5dbEbDB1f09910D",
      "address": "0xb38544cCf295D78B7AE7b2baE5dbEbDB1f09910D",
      "created_at": "2022-03-29T04:35:55.303Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! This is BlackHare,eager to be\n\nElement's governance representative!,I will introduce my situation\n\nEthereum Address:0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6\n\nDiscord handle:BlackHareKnight#7953\n\nTwitter Handle:@EtherHare\n\nStatement of Intention:\n\nValues:\n\nCooperation, sharing, democratic governance\n\nElement is a very good Defi financial system. The services provided by Element are universal and inclusive. I think it is very meaningful to participate in the governance of this inclusive financial system and achieve true democracy, which is in line with my values. As an Element experiencer, I will serve community users and educate early users while participating in governance. And participate in governance experiments and protocol improvements.\n\nMy web3 qualifications / skills:\n\nI focus on the promotion of the web3 education community. I am currently the RabbitHole governor. I have put forward many proposals, voted on many important proposals, and promoted them in the Chinese community at the same time. I was also an early contributor to the Odyssey web3 education community and made some contributions to promoting web3 to women.",
      "commonwealthCommentId": 17942,
      "commonwealthName": "BlackHare",
      "commonwealthPostedFromAddress": "0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6",
      "address": "0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6",
      "created_at": "2022-03-29T04:22:33.069Z",
      "ensName": "blackhare.eth"
    },
    {
      "plaintext": "Ethereum Address:0x2c66D11c2652b96301ee9caA61663b757d0BA2cd\n\nDiscord handle:Crypto.eth#4870\n\nTwitter Handle:@FbTbqZESJKoXFO4\n\n Hello, everyone! Nice to meet all of you at Element Community, let me introduce myself first,I'm an encryption enthusiast, And focus on the blockchain industry, I started digging BTC in 2017. ETH was excavated in 2018, There are many encryption enthusiasts like me around, And I also run a community, There are about two thousand people, They pursue freedom, equality, like me, And that's what appeals to me about Element Finance, It shows me the real devolution of power, Let everyone have the opportunity to participate and govern, Therefore, I come to apply for GSC representatives and candidates. I am willing to share Element Finance with friends around me, so that more people can understand it, and they have a certain professional foundation. They are early users of DEFI, such as UNI, AAVE, etc., and they are also NFT enthusiasts, and now they are working hard in the field of WEB3.0 and DAO. I believe that the participation of these people will have a positive impact on Element Community, and I hope I can contribute to Element Community.",
      "commonwealthCommentId": 17941,
      "commonwealthName": "hakyi",
      "commonwealthPostedFromAddress": "0x2c66D11c2652b96301ee9caA61663b757d0BA2cd",
      "address": "0x2c66D11c2652b96301ee9caA61663b757d0BA2cd",
      "created_at": "2022-03-29T04:22:05.150Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! This is BlackHare,eager to be\n\nElement's governance representative!,I will introduce my situation\n\nEthereum Address:0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6\n\nDiscord handle:BlackHareKnight#7953\n\nTwitter Handle:@EtherHare\n\nStatement of Intention:\n\nValues:\n\nCooperation, sharing, democratic governance\n\nElement is a very good Defi financial system. The services provided by Element are universal and inclusive. I think it is very meaningful to participate in the governance of this inclusive financial system and achieve true democracy, which is in line with my values. As an Element experiencer, I will serve community users and educate early users while participating in governance. And participate in governance experiments and protocol improvements\n\nMy web3 qualifications / skills:\n\nI focus on the promotion of the web3 education community. I am currently the RabbitHole governor. I have put forward many proposals, voted on many important proposals, and promoted them in the Chinese community at the same time. I was also an early contributor to the Odyssey web3 education community and made some contributions to promoting web3 to women",
      "commonwealthCommentId": 17939,
      "commonwealthName": "BlackHare",
      "commonwealthPostedFromAddress": "0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6",
      "address": "0x885ea391039e0FA3f6833a1F3B6d7433B5b69bb6",
      "created_at": "2022-03-29T04:21:59.189Z",
      "ensName": "blackhare.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x3adB265793103492149157648de01b87d1211D2b\n\nDiscord Handle: wtoqxy#6912\n\nTwitter @zao9999\n\nStatement of Intention:\n\nValues: Inclusion, Understanding, Mutual Help, Peace\n\nStatement of Intention: DAO governance is a very important part of the organization. It plays a role in decentralization. I hope to become a member of GSC. It will be my honor to be a member, and it is also a very great team to develop the community and achieve The community is inclusive and devoted to the research of defi for a long time. I believe that Element is a great team. The Element protocol cannot be ignored, and the development of the community cannot be ignored.\n\nMy web3 qualifications/skills:\n\n1. Active contributions of DAO: Ens, Parswap…\n\n2. Use various chains: Eth, Bsc, Polygon, Solana, Terra, Avalanch, Cosmos…\n\n3. layer2: Optimism, Arbitrum, Zksync, Starkware…\n\n4. Web3: Zerion, Galaxy, Slingshot, Paraswap, Uniswap, Bico...\n\nI hope and look forward to joining Element governance and making due contributions to governance.",
      "commonwealthCommentId": 17938,
      "commonwealthName": "coco",
      "commonwealthPostedFromAddress": "0x3adB265793103492149157648de01b87d1211D2b",
      "address": "0x3adB265793103492149157648de01b87d1211D2b",
      "created_at": "2022-03-29T04:09:35.655Z",
      "ensName": "brome.eth"
    },
    {
      "plaintext": "Ethereum Address: 0xe6F1F7200F1F6cFE0C3ab2391845760cCF9eD278\n\nDiscord handle: 8581#0660\n\nTwitter Handle: @coco20208581\n\nI am a software engineer, mainly engaged in process management system research and development, and I am also an encryption enthusiast. After learning defI and NFT automatically, I find that I want to join the trend of the next era",
      "commonwealthCommentId": 17935,
      "commonwealthName": "nice",
      "commonwealthPostedFromAddress": "0xe6F1F7200F1F6cFE0C3ab2391845760cCF9eD278",
      "address": "0xe6F1F7200F1F6cFE0C3ab2391845760cCF9eD278",
      "created_at": "2022-03-29T03:45:44.051Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x7de4ffA6081D4C1109979418343D6EfBd2343f88\n\nDiscord handle: coder#4672\n\nTwitter Handle: @caidian3\n\nElementers! I'm very glad to apply in GSC.Decentralization is about to change the world, and my company is gradually moving from Web2 to Web3. As a front-end engineer, I hope to support the growth of Element Finance!",
      "commonwealthCommentId": 17934,
      "commonwealthName": "coder",
      "commonwealthPostedFromAddress": "0x7de4ffA6081D4C1109979418343D6EfBd2343f88",
      "address": "0x7de4ffA6081D4C1109979418343D6EfBd2343f88",
      "created_at": "2022-03-29T03:39:56.404Z",
      "ensName": "bione.eth"
    },
    {
      "plaintext": "Hi, everybody, glad to meet you in Element community.\n\n Ethereum Address: 0x65f82961F225923Bd65e9E7ACb3a0F279954F08A\n\n Discord Handle : htjason#8159\n\n Statement of Intention: Transparency, Over-Communication, Community Inclusivity.\n\n Web3 Qualifications / Skills：Focus on web3 since2019, core members of PY DAO, full of enthusiasm.\n\n Governance experimentation: early members of wellkonwnDAOS, Uni,mkr,gtc,py, etc",
      "commonwealthCommentId": 17932,
      "commonwealthName": "jason",
      "commonwealthPostedFromAddress": "0x65f82961F225923Bd65e9E7ACb3a0F279954F08A",
      "address": "0x65f82961F225923Bd65e9E7ACb3a0F279954F08A",
      "created_at": "2022-03-29T02:58:48.625Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow me to introduce myself for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xA448c56a354A8FF2b5aaB489DF1348e9dfABDB7C\n\nDiscord Handle: luckquan(σ, σ)#1924\n\nTwitter Handle: @yangluckyeth\n\nStatement of Intention:\n\nValues: Transparency, fairness, hardworking, honesty.\n\nVision: I am a new comer to crypto actually .I only have 7 months experience.At first I believed crypto had a such amazing and promising future and I got obsessed with it.But slowly I started to doubt it.I didn't see the actual community participation in governance and I couldn’t see the truly decentralization of a project cause it is still controlled by the core member of the early developer of the project. A lot of projects are declaring they are moving towards decentralization but I don't believe they are actually going to implement it. right now the governance mainly focuses on the token the community members they hold, but it is highly affected by the whales. Another issue of this voting system is the low participation rate sometimes. We need to find out a more attractive and efficient way to encourage all the community members to get involved in governance.That is what I see in element and I truly believe it. I really want to be part of it and witness the future.\n\nReason why I want to become a delegate/GSC Member: As I talked above since element is going to get all community members to be involved in governance, and there are so many new comers to crypto so I want to convey the voice of these people. I THINK I know them better.\n\nWeb3 Qualifications / Skills:\n\nActive contributor in the following DAOs/Communities: 996DAO co-founder,PIP contributor, Yield examiner , RabbitHole (RH) content Pod\n\nRelevant Works/Proposals:create various education materials and help them to get to truly understand defi and element this amazing project. actively engage with the community and grow it stronger.",
      "commonwealthCommentId": 17927,
      "commonwealthName": "yang",
      "commonwealthPostedFromAddress": "0xA448c56a354A8FF2b5aaB489DF1348e9dfABDB7C",
      "address": "0xA448c56a354A8FF2b5aaB489DF1348e9dfABDB7C",
      "created_at": "2022-03-29T02:42:13.720Z",
      "ensName": "web3nftfuture.eth"
    },
    {
      "plaintext": " Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x2AaFBA1D57813C0c0fA9cC4834B10B82F3492DcE\n\nDiscord Handle: 天空#7500\n\nTwitter @luwei67186951\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nStatement of Intention:  DAO governance will be an important organizational form in the future, especially in the field of decentralization. I hope DAO can bring fairness and justice to the world, protect personal private property from inviolability, and realize true democracy. Eagerly hope to become the representative of Element and grow together with it to become a model of DAO governance.\n\nMy web3 qualifications / skills：\n\nDebank the first mint qualification\n\ncrema Finance community ambassador\n\n9",
      "commonwealthCommentId": 17926,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x2AaFBA1D57813C0c0fA9cC4834B10B82F3492DcE",
      "address": "0x2AaFBA1D57813C0c0fA9cC4834B10B82F3492DcE",
      "created_at": "2022-03-29T02:40:30.035Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x84dC915a87fF4257B553f0AE49ad55cD2167C777\n\nDiscord Handle: duanasd#2851\n\nTwitter Handle: @jacksto83178160\n\nIt's my great honor to have this opportunity. I am a salesman. Ever since I learned about Satoshi Nakamoto and Bitcoin from the news, I have been faced with the constant devaluation of bank cards. I apply to join, and I am willing to participate in the community promotion of this project, so that people can find their future from the crypto economy",
      "commonwealthCommentId": 17925,
      "commonwealthName": "echo",
      "commonwealthPostedFromAddress": "0x84dC915a87fF4257B553f0AE49ad55cD2167C777",
      "address": "0x84dC915a87fF4257B553f0AE49ad55cD2167C777",
      "created_at": "2022-03-29T02:23:07.946Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0xd39392E26615Af87727eABad031f453C81f6dE47\n\nDiscord Handle: sweetorange#1288\n\nTwitter Handle: @yorkorange1\n\nFirst of all, I think decentralized network is the standard of the next generation world, decentralized finance, decentralized social, etc. I am a database engineer, and the process of decentralization has really changed my understanding of my current job. I am currently learning cryptographic development, contract development, I hope to join The Governance Steering Council",
      "commonwealthCommentId": 17922,
      "commonwealthName": "flyaway",
      "commonwealthPostedFromAddress": "0xd39392E26615Af87727eABad031f453C81f6dE47",
      "address": "0xd39392E26615Af87727eABad031f453C81f6dE47",
      "created_at": "2022-03-29T02:08:49.067Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x323b06f8a39c87645B6A717884A8113861114f2b\n\nDiscord handle: mikessrw#2155\n\nTwitter Handle: @sweetbe73400567\n\nElementers! I'm very glad to apply in GSC.Decentralization is about to change the world, and my company is gradually moving from Web2 to Web3. As a front-end engineer, I hope to support the growth of Element Finance!",
      "commonwealthCommentId": 17921,
      "commonwealthName": "chinpanzee",
      "commonwealthPostedFromAddress": "0x323b06f8a39c87645B6A717884A8113861114f2b",
      "address": "0x323b06f8a39c87645B6A717884A8113861114f2b",
      "created_at": "2022-03-29T01:56:22.683Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x0e024CdBA8377ACF2d83e23090e27f5F8F490497\n\nDiscord Handle: StormG#9999\n\nTwitter Handle: @CryptoStormG\n\nStatement of Intention:\n\nFirst of all, I am a deep user of element, not only have an address to take, I like to use this way to avoid risks and get stable profits.\n\nSecondly, I am an All in Crypto person, you can see my on-chain activity to confirm this. I love this project and would love to be more involved in building it.\n\nFinally, I wish you all the best of success!\n\nMy web3 qualifications / skills:\n\nI am a mobile development engineer, proficient in JAVA and other mobile development languages, and have knowledge of front-end.\n\nAlso I am a person who has a lot of experience in Defi, NFT, Gamefi, DAO, Socialfi fields.\n\nAt the same time I am proficient in operating Chinese communities, have rich Mod experience, and have done Mod in many communities (such as Alchemist, Colony, etc.).\n\nHope I can join you guys. Contribute to the community",
      "commonwealthCommentId": 17920,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x0e024CdBA8377ACF2d83e23090e27f5F8F490497",
      "address": "0x0e024CdBA8377ACF2d83e23090e27f5F8F490497",
      "created_at": "2022-03-29T01:55:50.515Z",
      "ensName": "stormg.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address:0x8518a66A647531A0fa7AE381dE0d42f865cD0bc6\n\nDiscord handle:lan#1376\n\nTwitter Handle:@momo_7211\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nMy web3 qualifications / skills:\n\nI am a Computer Engineer that has been working in Financial Institutions and launching financial startups, last 5 years focus in Crypto/DeFi. I am ambassador of MakerDAO, and participating actively in communities like Balancer, Enzyme, Superfluid, Unslashed, Perpetual or Potion Finance.\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has. One thing is for certain, the future is incredibly bright for both Element Fi and DeFi Governance!",
      "commonwealthCommentId": 17919,
      "commonwealthName": "jask",
      "commonwealthPostedFromAddress": "0x8518a66A647531A0fa7AE381dE0d42f865cD0bc6",
      "address": "0x8518a66A647531A0fa7AE381dE0d42f865cD0bc6",
      "created_at": "2022-03-29T01:51:58.096Z",
      "ensName": null
    },
    {
      "plaintext": "Hi Element Community\n\nEthereum Address: 0x94117B3B675024AAE07f0eF864CBaDf044Ff3BFC\n\nDiscord Handle: springside#7096\n\nTwitter Handle: @echo73152866\n\nMy web3 qualifications / skills:\n\nI am a software engineer, mainly engaged in process management system research and development, and I am also an encryption enthusiast. After learning defI and NFT automatically, I find that I want to join the trend of the next era",
      "commonwealthCommentId": 17918,
      "commonwealthName": "springside",
      "commonwealthPostedFromAddress": "0x94117B3B675024AAE07f0eF864CBaDf044Ff3BFC",
      "address": "0x94117B3B675024AAE07f0eF864CBaDf044Ff3BFC",
      "created_at": "2022-03-29T01:43:37.175Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0xcd5561b1be55C1Fa4BbA4749919A03219497B6eF\n\nDiscord Handle: renesis#0088\n\nTwitter Handle: @ChanglongY\n\nHello, Elementers!\n\nI'm very glad to apply in GSC.\n\nI am a cryptographic enthusiast since 2016, and I was involved in Element Finance at an early time.\n\nElement Finance is the next generation DeFi lego, which is very familiar to banks in the real world. This is very important to attract people outside the current crypto circle.\n\nValues: Transparency, Translation (Chinese and Japanese), Delegation of retail investors with a small mount\n\nRelevant Works/Proposals:\n\nSnapshot Governance (include UNI, BAL and so on)\n\nCosmos ecosystem Governance",
      "commonwealthCommentId": 17917,
      "commonwealthName": "renesisY",
      "commonwealthPostedFromAddress": "0xcd5561b1be55C1Fa4BbA4749919A03219497B6eF",
      "address": "0xcd5561b1be55C1Fa4BbA4749919A03219497B6eF",
      "created_at": "2022-03-29T01:41:37.346Z",
      "ensName": "renesisy.eth"
    },
    {
      "plaintext": "Hi Element Community. Let me present my self for the call for Delegates & GSC Members.\n\nEthereum Address: 0x044fdb7EFd180c88930a25d42E8E8FcbAAD9f0FF\n\nDiscord Handle Franks raca#3295\n\nTwitter Handle @Franksxiaofu\n\nStatement of Intention:\n\nOne of my battles for a long time has been trying to explain that improving financial services is probably one of the most social goals we can pursue. It is important to understand that when we invest, in most cases we are supporting other people who start their ideas.\n\nThat the highest degree of financial development correlates with more wealth for society. That the markets allow us to coordinate much better. That this coordination is necessary to advance and create value as a society\n\nWhen we work to create a project like Element we are improving the financial world and with it our society, it is not a mere exercise in speculation. Element is a protocol that allows risk sharing with different agents to delegate in the agents that can afford it.. Enabling these services to be universal and inclusive.\n\nIt is a job that I would like to be a more active part of, but I will be happy to help from any position.\n\nMy web3 qualifications / skills:\n\nFrom the beginning I have been using the Element protocol and sharing it with our crypto plaza community, as well as sending suggestions when doing so.\n\nI am a Computer Engineer that has been working in Financial Institutions and launching financial startups, last 5 years focus in Crypto/DeFi. I am ambassador of MakerDAO, and participating actively in communities like Balancer, Enzyme, Superfluid, Unslashed, Perpetual or Potion Finance.\n\nI have work in the tokenomics of several projects like Climate Trade, Ethichub, EasyFeedback, Tutellus. Leading Roble Venture Capital, one of the most active VC in Crypto in Spanish Ecosystem.\n\nFounder of Crypto Plaza, one of the largest Spanish Communities that usually translate and promote DeFi . Founder of the Spanish Fintech Association that has promote regulatory Sandbox in Spain, where Crypto Projects are applying in Spain. Founder of the IberoAmerica Fintech Aliance.\n\nI think I can help in differente areas, like Strategic Initiatives and also y treasury management. And happy to can represent all the Element community in the more transparent way. And following with the protocol improvement as a heavy user of Element.\n\nThanks for your time, and looking forwar to can help in this amazing project.",
      "commonwealthCommentId": 17915,
      "commonwealthName": "Franks",
      "commonwealthPostedFromAddress": "0x044fdb7EFd180c88930a25d42E8E8FcbAAD9f0FF",
      "address": "0x044fdb7EFd180c88930a25d42E8E8FcbAAD9f0FF",
      "created_at": "2022-03-29T01:38:48.635Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x33f572D61ca18A6C5cB8B0f7eB09E2253F415A55\n\nDiscord Handle: 0.eth#6942\n\nTwitter Handle: @atonesapple\n\nHello, fellow elements community!\n\nI am very happy and hope to participate in decentralized governance. First of all, I am a cryptographic enthusiast, and I often pay attention to and study the development of new technologies. I have witnessed the rapid development of blockchain technology.  As an early supporter of Element. fi, I participated in the pledge and combination of the main network.  First of all, the project is very good, and the team is very serious about every step and building the community.  With the rapid development of web3 projects, Web3 will reposition itself into a new economic model and market. As a participant, I am very happy.",
      "commonwealthCommentId": 17908,
      "commonwealthName": "apple",
      "commonwealthPostedFromAddress": "0x33f572D61ca18A6C5cB8B0f7eB09E2253F415A55",
      "address": "0x33f572D61ca18A6C5cB8B0f7eB09E2253F415A55",
      "created_at": "2022-03-29T01:08:42.201Z",
      "ensName": "atonesapple.eth"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x8781eF9d4Ec71bBF965980E6C7649c8fc09DB28b\n\nDiscord Handle: yt#3483\n\nTwitter Handle:@Ytt95607420\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nVision:I have always had a deep fascination with DAO coordination along with the foundational principle of community ownership. Being involved in multiple DAOs it has been a privilege to not only interact with the community, but to experiment and take in the adhered governance model(s). However, as we've seen lately majority of \"traditional\" (pioneering) DeFi protocols have experienced a sense voting power centralization amongst active, community thought leaders. With the emergence of meta-governance, veTokens, and now Element Finance's Voting Vault primitive, we can begin experimenting towards a true decentralized and community-orient & owned future. Ultimately, my goal is to be a true community representative/steward that directly reflects community sentiment(s), thoughts of experimentation & exploration, and overall fairness",
      "commonwealthCommentId": 17907,
      "commonwealthName": "yantao",
      "commonwealthPostedFromAddress": "0x8781eF9d4Ec71bBF965980E6C7649c8fc09DB28b",
      "address": "0x8781eF9d4Ec71bBF965980E6C7649c8fc09DB28b",
      "created_at": "2022-03-29T01:06:41.797Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x93f4C8F670578F6D10bf8b77826F04E9C3A4B9E2\n\nDiscord Handle: petergny#1854\n\nTwitter Handle: @peter_gny\n\nHello,Element Community,\n\nFirst of all, I'm just an ordinary encryption amateur, I block chain may also compare the lack of experience, but I have a lot of time to learn to build a project,The infinite possibilities of blockchain fascinate me. The distinctive features of fairness, transparency, and decentralization all excite me. However the current governance model of blockchain projects is much criticized. The mere distribution of governance token seems very uninspiring. Community participation is low and uninteresting. element has been focusing on the governance innovation model of the protocol. The viewpoint is unique and never blind. If Element's governance model works, it will be unprecedented and will definitely force other projects to follow. It's a great thing. It's exciting to think about. I really hope I can do my best to participate in the early governance system of Element. Looking forward to it.\n\nMy blockchain resume\n\n5 years in the block.\n\nHave organized many offline salons for projects.\n\nCommunity mod.",
      "commonwealthCommentId": 17901,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x93f4C8F670578F6D10bf8b77826F04E9C3A4B9E2",
      "address": "0x93f4C8F670578F6D10bf8b77826F04E9C3A4B9E2",
      "created_at": "2022-03-28T22:18:43.782Z",
      "ensName": "eth001.eth"
    },
    {
      "plaintext": "I am Tommy from Taiwan.\n\nEthereum Address:  0x4dbfce0D1e297524631B6a26852572380Cd56aAD\n\nDiscord Handle:  Tommydume#9327\n\nTwitter Handle : @tommydume\n\nStatement of Intention :\n\nI am a cryptocurrency trader and senior on-chain researcher. I am very enthusiastic about discovering new projects and participating in their early testing, reporting bugs to the project side in a timely manner, promoting and attracting good participants and more crypto enthusiasts to participate, I think this is a cool thing to do for crypto A healthy development for the currency. Your reasons for wanting to be a representative and/or GSC member.\n\nWeb3 qualifications/skills (advocacy, community, article writing)\n\nAnd feel free to include the areas you wish to focus on as a representative, for example (defi, gamefi, X to earn:",
      "commonwealthCommentId": 17888,
      "commonwealthName": "tommydume",
      "commonwealthPostedFromAddress": "0x4AadE9eF175A61E008473ee8965eB6754F41c213",
      "address": "0x4dbfce0D1e297524631B6a26852572380Cd56aAD",
      "created_at": "2022-03-28T18:36:51.970Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x2bcf59E816178dfdBF66D7CfC37D32687f104ae4\n\nDiscord Handle: xiaozhen928#4026\n\nTwitter Handle: @xiaozhen9280\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nVision:I have always had a deep fascination with DAO coordination along with the foundational principle of community ownership. Being involved in multiple DAOs it has been a privilege to not only interact with the community, but to experiment and take in the adhered governance model(s).",
      "commonwealthCommentId": 17887,
      "commonwealthName": "xiaozhen",
      "commonwealthPostedFromAddress": "0x2bcf59E816178dfdBF66D7CfC37D32687f104ae4",
      "address": "0x2bcf59E816178dfdBF66D7CfC37D32687f104ae4",
      "created_at": "2022-03-28T18:29:54.388Z",
      "ensName": "xiaozhen.eth"
    },
    {
      "plaintext": "Ethereum Address: 0xCc1d91a9210f99A0E4EDFE7B21Ce8905a05F2b6f\n\nDiscord Handle: bestman08#8425\n\nTwitter Handle: https://twitter.com/bestman9608\n\n Hello,Element Community,\n\n First of all, I'm just an ordinary encryption amateur, I block chain may also compare the lack of experience, but I have a lot of time to learn to build a project, this may be one of the few I meet the conditions. Etheric fang lianchuang and Polkadot founder Dr Gavin Wood was proposed in 2014 by a revolutionary Web3.0 idea, and then launched into Web3 foundation. His philosophy is: \"Web3 is to make the Internet more decentralized, verifiable, safe and launched a set of a wide range of motion and agreement; Web3 vision is to achieve the Internet without server, decentralization, namely the user control over his identity, data, and the fate of the Internet; Web3 will launch a new global digital economy system, create new business models and new market, break the monopoly platform, to promote extensive, bottom-up innovation\",The keyword of WEB3 as I understand it is freedom - \"freedom of rights, freedom of rights and interests\", and the way to achieve this goal is to participate in the great DAO governance, everyone can make decisions on their own behalf for their own rights, for the sake of I will work hard for my own rights, I am willing to give my time to Element, please give me a chance, thank you",
      "commonwealthCommentId": 17886,
      "commonwealthName": "Bestman",
      "commonwealthPostedFromAddress": "0xCc1d91a9210f99A0E4EDFE7B21Ce8905a05F2b6f",
      "address": "0xCc1d91a9210f99A0E4EDFE7B21Ce8905a05F2b6f",
      "created_at": "2022-03-28T18:16:40.466Z",
      "ensName": "199608.eth"
    },
    {
      "plaintext": "Hello Element Community,\n\nI wish to become a delegate of Element Finance and take part into the decentralized governance.\n\nEthereum Address: 0x8F5dAd7f4DB78df43A082ebE6A9B8311A8888888\n\nDiscord Handle: Dj97com#7778\n\nTwitter Handle: @Dj97com\n\nBeing an Element Finance protocol user, I firmly believe in that Element makes DeFi better and will devote myself to the great project.\n\nAs a delegate, I will take part into governance experimentation and protocol improvements. Further providing services and support to locals users merging into Element community.",
      "commonwealthCommentId": 17881,
      "commonwealthName": "Dj97com",
      "commonwealthPostedFromAddress": "0x8F5dAd7f4DB78df43A082ebE6A9B8311A8888888",
      "address": "0x8F5dAd7f4DB78df43A082ebE6A9B8311A8888888",
      "created_at": "2022-03-28T17:47:07.257Z",
      "ensName": "888888.ethid.eth"
    },
    {
      "plaintext": "Hello everyone! I am honored to participate in this solicitation as the representative of bigplayerdao .\n\nEthereum Address:  0x00EE80c322D6e956D2629a73223605bBda946F2d\n\nDiscord Handle:  wsdxbz#3048\n\nTwitter Handle : @wsdxbz1\n\nStatement of Intention\n\nbigplayerdao is from Asia. I am one of the founding members of bigplayerdao. We are committed to the discovery and dissemination of excellent projects so that more Asians can participate in the construction of web3.\n\nDefi is changing the world, IRS protocol is part of it, I believe IRS protocol has unlimited potential.I'm glad to see that element is changing the defi world in its own way. Compared with other IRS protocols, element's operability and convenience are more worthy of participation. bigplayerdao is also gradually growing, and more than 5,000 members have joined and participated in it. I hope to learn governance experience and provide continuous feedback during the process of participating in element governance to ensure the greatest fairness in community governance.\n\nmy interest:\n\ngovernance experiment\n\nBuild a reasonable framework and ensure that the interests of community members are maximized\n\nFunding Scheme\n\nProvide support and assistance to projects that are conducive to the development of element\n\nWeb3 Qualifications / Skills (optional)\n\n- As the organizer of bigplayerdao, I promote and introduce many early web3 projects in Chinese: biconomy, prysm, wall, riskbarbor, liquality, aztec .I also act as ambassador or og for some of these projects\n\nLooking forward to more Asian users entering defi, in fact, I have seen them~",
      "commonwealthCommentId": 17875,
      "commonwealthName": "BIPLAYERDAO  ",
      "commonwealthPostedFromAddress": "0x00EE80c322D6e956D2629a73223605bBda946F2d",
      "address": "0x00EE80c322D6e956D2629a73223605bBda946F2d",
      "created_at": "2022-03-28T17:27:13.453Z",
      "ensName": "bigplayer.eth"
    },
    {
      "plaintext": "Hey everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x631ab8EB40588543dF900263F864b6376d56A587\n\nDiscord Handle: nullptr#2198\n\nTwitter Handle: noneptr\n\nStatement of Intention:\n\nValues: Honest, Open, Positive, Visionary\n\nVision: I have always believed that DAO will become a trend of future corporate governance, not just in the blockchain industry. Glad to see Element Finace embrace DAO so aggressively. Frankly speaking, I was very bullish on Element Finace from the beginning, I even predicted that Element Finace would become the Swiss bank of the Web3 era. When I first learned about Element Finace's fixed rate, it was fantastic! I hope Element Finance will be the go-to financial product for every user in the future web3!\n\nWhy me? :Unlike other candidates, I am too ordinary, in fact, I think we need a common user to participate in governance, which is very important for the development of Element Finace in the future, we need the voice of ordinary users! I'm a Google programmer from web2 with a strong interest and experience in blockchain. So why not me?\n\nRelevant Works/Proposals:\n\nUNI Governance\n\nBAL Governance\n\nAAVE Governance\n\nBigPlayer Dao Co-Founder\n\nAcross Protocol Co-Founder\n\nAs an early supporter of element.fi, my wallet has left an indelible mark on both the testnet and mainnet of element.fi. Now I must seize this opportunity of becoming a potential GSC delegate & candidate.",
      "commonwealthCommentId": 17874,
      "commonwealthName": "Neo",
      "commonwealthPostedFromAddress": "0x631ab8EB40588543dF900263F864b6376d56A587",
      "address": "0x631ab8EB40588543dF900263F864b6376d56A587",
      "created_at": "2022-03-28T17:15:10.406Z",
      "ensName": "webtc.eth"
    },
    {
      "plaintext": "Hello everyone, I would like to introduce myself to you here.\n\nEthereum Address : 0x6275D233A12B7CC747E41543878c31b604D0bAE1\n\nDiscord Handle : TiJoy#2045\n\nTwitter Handle : @TiJoy_Lee\n\nStatement of Intention:\n\nI think Element Community is a valuable DAO and I want to do contributions for it. I think it is worth to make ecosystem efficient and it is what Element Protocol is doing. I hope to be a member of GSC. Thanks.",
      "commonwealthCommentId": 17873,
      "commonwealthName": "tijoy",
      "commonwealthPostedFromAddress": "0x6275D233A12B7CC747E41543878c31b604D0bAE1",
      "address": "0x6275D233A12B7CC747E41543878c31b604D0bAE1",
      "created_at": "2022-03-28T17:11:06.818Z",
      "ensName": "neuropace.eth"
    },
    {
      "plaintext": "Good day, here's my application for becoming a GSC delegate & candidate.\n\nI am from Switzerland\n\nDiscord Handle:  cans#9823\n\nEthereum Address:  0x24b3e9984Eb93c207BE67Be0b632A24F07a0703F\n\nTwitter Handle:  @senphul\n\nStatement of Intention:\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally.\n\nTherefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, BSC, AVAX,STX,Polygon, Fantom, Solana, Terra and Cosmos.\n\n- Yield farming, trading, delta neutral.\n\n- Research & translation: Curvance",
      "commonwealthCommentId": 17872,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x24b3e9984Eb93c207BE67Be0b632A24F07a0703F",
      "address": "0x24b3e9984Eb93c207BE67Be0b632A24F07a0703F",
      "created_at": "2022-03-28T16:56:17.553Z",
      "ensName": "keycat.eth"
    },
    {
      "plaintext": "Hey everyone,\n\nReverie is putting forward an application to be an active delegate for the Element Finance community.\n\nEthereum Address: reveriegov.eth, or 0xb55a948763e0d386b6dEfcD8070a522216AE42b1\n\nTwitter Handle: @hi_Reverie\n\nDiscord Handle : fede#2988\n\nStatement of Intention\n\nReverie is a governance-focused organization dedicated to helping DAOs grow. Our core values include transparency, accountability, and being long-term aligned contributors.\n\nWe are proponents of DAOs that combine a community-oriented approach to experimentation with thoughtful decision-making, accountability, and clear focus areas for contributors. We couldn't be more supportive and aligned with the Element Finance team and its community.\n\nWe've also recently recorded a podcast with Charles and Paul on Element Finance's governance system. In the episode, we go into Element Finance's key governance innovations, voting vaults, governance incentives, and more. We think that Element is pioneering an innovative new model for DeFi governance that can serve as a pioneering system for many protocols in the future.\n\nWeb3 Qualifications / Skills\n\nAt Reverie, we actively seek strategies to grow the protocols we’re involved in. This includes anything from initial governance design and development to capital allocation, treasury management, grants programs, legal strategy, and anything else that can add value.\n\nWe have a team of 4 people with various backgrounds, including venture capital, institutional market-making, operations, and consulting. Currently, we are active contributors and delegates to projects such as Uniswap, Compound, dYdX, and more.\n\nSome of our relevant Governance proposals:\n\nCompound Grants Program - Lessons and Next Steps\n\nAuditing Compound Protocol\n\ndYdX Grants Program\n\nGuernsey Purpose Trust for the dYdX Grants Program\n\nDeFi Education Fund\n\nWe couldn't be more excited to present our candidacy and work with the Element Finance community!",
      "commonwealthCommentId": 17871,
      "commonwealthName": "Reverie",
      "commonwealthPostedFromAddress": "0xb55a948763e0d386b6dEfcD8070a522216AE42b1",
      "address": "0xb55a948763e0d386b6dEfcD8070a522216AE42b1",
      "created_at": "2022-03-28T16:55:25.649Z",
      "ensName": "reveriegov.eth"
    },
    {
      "plaintext": "Hi everyone, I am very interested in this project and glad to have this opportunity to introduce myself and apply for a delegate\n\nEthereum Address:  0xe93735Deb30AAa0810DfdA7fb2B0E2115982B1d1\n\nDiscord Handle:  Randolph#8619\n\nTwitter Handle:  @Randolp18272769\n\nStatement of Intention:\n\nI am a front-end developer of a web3 company, and I am very interested in the blockchain industry and passionate about decentralization. Now I am participating in several DAO and working with community members to build the decentralized infrastructure for the future of our industry. I hope to work with this project to promote the development of decentralization.\n\nWeb3 Qualifications / Skills：\n\nI have 1 year front-end develop experience\n\nI was early member of DevDao and peopleDao\n\nI have participated in many defi、gamefi and NFT projects and provided some assistance to the project",
      "commonwealthCommentId": 17869,
      "commonwealthName": "Randolph",
      "commonwealthPostedFromAddress": "0xe93735Deb30AAa0810DfdA7fb2B0E2115982B1d1",
      "address": "0xe93735Deb30AAa0810DfdA7fb2B0E2115982B1d1",
      "created_at": "2022-03-28T16:45:46.811Z",
      "ensName": "randolphph.eth"
    },
    {
      "plaintext": "To become a delegate and a candidate for the GSC, post a short reply in this thread that includes the following:\n\nEthereum Address：0xb4D8063B3446CEC0C536208807241767A0eA6D18\n\nStatement of Intention: As a recent user of element, I think this model is my first contact. I want to grow with element dao, because I think web3.0 will make the world a better place, and there will be more and more dao organizations in the future.",
      "commonwealthCommentId": 17868,
      "commonwealthName": "tippice",
      "commonwealthPostedFromAddress": "0xb4D8063B3446CEC0C536208807241767A0eA6D18",
      "address": "0xb4D8063B3446CEC0C536208807241767A0eA6D18",
      "created_at": "2022-03-28T16:41:09.617Z",
      "ensName": "4god.eth"
    },
    {
      "plaintext": "Hello everyone! here is my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x6d9104f626D7f4145Dda92Cf06c336F82f2135e7\n\nDiscord Handle: LAOER#8524\n\nTwitter Handle: @laoer04000494\n\nStatement of Intent:\n\nValues: community collaboration, dao principles, encryption spirit.\n\nVision: I hope element can continue the encryption spirit, return to the original intention of encryption on the basis of cooperation, collaboration and communication, and build a truly decentralized defi governance community.\n\nReason: DAO governance has always been a difficult problem in the currency circle. How to mobilize the enthusiasm of community members and let each member actively participate in community governance is a big problem, and how to avoid excessive centralization of the community and lead to the result of large players controlling the agreement is also worthwhile conseidered by every crypto project. Element does not implement community governance by issuing tokens like other projects, but has created a unique model, which is a brand new innovation in the currency circle. I am very excited about this and hope to be able to join such an interesting and professional team. In governance activities, I hope to grow and explore together with element to achieve true decentralized community governance.\n\nWeb3 qualifications/skills: Active contributors to the following DAOs/communities: across protocol rss3 dydx\n\nI am more interested in the Governance experimentation and am looking forward to joining Element Finance governance.",
      "commonwealthCommentId": 17867,
      "commonwealthName": "rweqw",
      "commonwealthPostedFromAddress": "0x6d9104f626D7f4145Dda92Cf06c336F82f2135e7",
      "address": "0x6d9104f626D7f4145Dda92Cf06c336F82f2135e7",
      "created_at": "2022-03-28T16:38:07.730Z",
      "ensName": "laoer6666661.eth"
    },
    {
      "plaintext": "Hello Element Community, I am zhizhi, change agent and always happy to help!\n\nEthereum Address: 0xA45e4DA10f86579FF2D37CBf29Fc7B27C08A22fA\n\nDiscord Handle: NIL ⎮ ZhiZhi#9035\n\nTwitter Handle: @Chen_zhizhi233\n\nStatement of Intention:  I intend to be a part of GSC to add valuable and strategic contributions and make ELF innovative governance and ecosystem efficient, reliable and sustainable via supporting and voting progressive proposals. I value simplicity, honesty, excellence, innovation, shared ideas, teamwork and decentralization.\n\nWeb3 Qualifications / Skills: I enjoy the new and exciting experience of web 3.0 as an MD Ph.D. I am Nid DAO's Chinese administrator and Gyroscope's translator. As a Chinese moderator, I'm also involved in several NFT projects and have a lot of community management experience.\n\nDelegate Area: I desire to join Governance experimentation  and would appreciate your consideration and acceptance.\n\nThank you!",
      "commonwealthCommentId": 17866,
      "commonwealthName": "zhizhi",
      "commonwealthPostedFromAddress": "0xA45e4DA10f86579FF2D37CBf29Fc7B27C08A22fA",
      "address": "0xA45e4DA10f86579FF2D37CBf29Fc7B27C08A22fA",
      "created_at": "2022-03-28T16:37:28.517Z",
      "ensName": "icpfleetteelfpci131452199585201748.eth"
    },
    {
      "plaintext": "Hello everyone, I want to be a part of gsc and improve help for all community members!\n\nEthereum Address: 0x314A565c67c841ef46569998412BbE810332EC77\n\nDiscord Handle: kang#3545\n\nTwitter Handle: @kang1782\n\nMy reasons for wanting to be a delegate:\n\nI believe that web3 in the truest sense gives us the ability to escape from a broken system and work together collaboratively to build a new one. Although I don't discuss it much as with many folks in the space I started off my career in finance, mostly machine learning for lending models. I can confidently say, at least from that experience, that most of what is happening in tradfi is pretty much made up based on outdated historical legacy.\n\nAt the same time, I think DeFi has a lot of potential but needs to mature both in terms of the kinds of products it offers and the incentives + models for governance it uses to manage them. I believe Element is a GoodTM step forward in the sense that it's put a lot of thought and care into both, in ways that I believe can help advance standards for the space and help us make changes to the existing system faster, with more credibility.\n\nStatement of Intent\n\nThe Element protocol has been a needed Lego brick in the broader DeFi primative landscape. As I have pointed out before, fixed rates and interest rate swap markets are a crucial component of well functioning financial systems around the world. For DeFi to achieve what we all believe it can a protocol like Element will be needed.\n\nThat said we’re still very much in the infancy of DeFi in general and the Element protocol in particular. In these early days it will be crucial to establish a set of processes for how the protocol is governed, and to define the standards by which GSC members are held. As one of the earliest members of the Element community and an investor in Element Finance I bring a unique perspective that will be valuable as we chart a course for Element as a decentralized protocol. Through my experience as as one of the eleven elected Emissaries for the Echelon Prime Foundation (a decentralized Play-to-Earn ecosystem) I know what it takes build solid foundations that will outlast those of us who first serve on the council.",
      "commonwealthCommentId": 17865,
      "commonwealthName": "kang",
      "commonwealthPostedFromAddress": "0x314A565c67c841ef46569998412BbE810332EC77",
      "address": "0x314A565c67c841ef46569998412BbE810332EC77",
      "created_at": "2022-03-28T16:37:05.780Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x52896Bf40B9A801511C211ab6Ae93895B3Bd4391\n\nDiscord Handle: Niugulia1#6587\n\nStatement of Intention:\n\nAs DAOs are decentralized autonomous organization,\n\neverything is based on code in blockchain which is transparency for anyone in the community\n\nwho're supposed to make the right decision to lead the protocol. I'm really interested to be part of it for long-term success in this project.\n\nWeb3 Qualifications / Skills:\n\n- Ethereum, BSC, Polygon, Solana explorer\n\n- Web3 Project galaxy dedication\n\n- Research & translation",
      "commonwealthCommentId": 17864,
      "commonwealthName": "dad",
      "commonwealthPostedFromAddress": "0x52896Bf40B9A801511C211ab6Ae93895B3Bd4391",
      "address": "0x52896Bf40B9A801511C211ab6Ae93895B3Bd4391",
      "created_at": "2022-03-28T16:33:52.955Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address : 0x410a0887cC91cCf1e8Db56422b9a5D8B078c2200\n\nDiscord Handle : 马蹄橘子#5195\n\nTwitter Handle : @bitcoinzhang1\n\nStatement of Intention :\n\nIn web3 ecosystem ,DAO governance will make a significant role in decentralization ecosystem. I wish I can contribute to make element finance grow together to establish DAO goverance model\n\nWeb3 Qualifications / Skills ：\n\nKeywordclub co-founder\n\nWeb3 activity involvement like RSS3,EthSign,Galaxy,Hahsflow\n\nParticipated in the internal testing of several early dapps and provided feedback\n\nMarketing",
      "commonwealthCommentId": 17863,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x410a0887cC91cCf1e8Db56422b9a5D8B078c2200",
      "address": "0x410a0887cC91cCf1e8Db56422b9a5D8B078c2200",
      "created_at": "2022-03-28T16:32:14.364Z",
      "ensName": "bitcoinorange.eth"
    },
    {
      "plaintext": "Hello everyone, I’m very glad to have this opportunity to introduce myself to you here\n\nEthereum Address:  0xe6752C11F6266588cDf708cFd42bf1fe15eec2F5\n\nDiscord Handle:  CryptoHunter#9432\n\nTwitter Handle:  @gong993996\n\nStatement of Intention:\n\nAs a blockchain developer, I have witnessed the revolution and development of the blockchain industry, more and more new things are building a more decentralized online world, It is a trend to redefine the original rights architecture in the form of Dao.\n\nIt was very meaningful for me to contribute early and grow with the community. Let’s push open the gate and step into the Elfiverse, shaping the future of Element.\n\nWeb3 Qualifications / Skills：\n\nI have 2 years of experience in blockchain development\n\nI was early member of RugRadio Dao and PeopleDao\n\nEarly tester of many web3 projects\n\nI have a keen interest in Governance experimentation and Protocol improvements",
      "commonwealthCommentId": 17862,
      "commonwealthName": "gong993996",
      "commonwealthPostedFromAddress": "0xe6752C11F6266588cDf708cFd42bf1fe15eec2F5",
      "address": "0xe6752C11F6266588cDf708cFd42bf1fe15eec2F5",
      "created_at": "2022-03-28T16:29:00.677Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone, Element's governance has finally started, so excited.\n\nEthereum Address:  0x290276C66Bb48Ff991d0333f03CdbD838c76aE2f\n\nDiscord Handle:  liues#6945\n\nStatement of Intention:\n\nAs DAOs are decentralized autonomous organization,\n\neverything is based on code in blockchain which is transparency for anyone in the community",
      "commonwealthCommentId": 17839,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x290276C66Bb48Ff991d0333f03CdbD838c76aE2f",
      "address": "0x290276C66Bb48Ff991d0333f03CdbD838c76aE2f",
      "created_at": "2022-03-28T05:50:42.955Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address:0x5584cF54ADE7C81aB6d6Bc870C714F87FC0a7721\n\nDiscord Handle:milan#3735\n\nStatement of Intention:\n\nThank you for giving me this opportunity. I am not as knowledgeable as you, but I hope to learn and contribute.\n\nSkills:\n\nI am Japanese. I want to spread the word about Element Finance to Japanese people. And I have experience in moderating and translating.",
      "commonwealthCommentId": 17834,
      "commonwealthName": "milan",
      "commonwealthPostedFromAddress": "0x5584cF54ADE7C81aB6d6Bc870C714F87FC0a7721",
      "address": "0x5584cF54ADE7C81aB6d6Bc870C714F87FC0a7721",
      "created_at": "2022-03-27T23:17:26.287Z",
      "ensName": "milan1899.eth"
    },
    {
      "plaintext": "Ethereum Address: 0x5bB16B1A4C11478bEAe10413af3c2fF47E64c03C\n\nDiscord Handle : BLUE#8682#7757\n\nTwitter Handle : https://twitter.com/h earthstop\n\nStatement of Intention:\n\nMy View & Vision :\n\nI am a college student who dreams of becoming a developer. While attending university, I learned blockchain technology and saw many platforms that applied it to Defi. Seeing many assets grow according to the rules using the blockchain, I became interested in Natural Diffie, and I want to experience it as a team.\n\nMy qualifications / Skills\n\n1. I understand blockchain technology.\n\n2. You can code using blockchain.\n\n3. I have experience in CM and MOD.\n\nPlease be the Elemental Finance that will give me a lot of experience.",
      "commonwealthCommentId": 17830,
      "commonwealthName": "nero",
      "commonwealthPostedFromAddress": "0x5bB16B1A4C11478bEAe10413af3c2fF47E64c03C",
      "address": "0x5bB16B1A4C11478bEAe10413af3c2fF47E64c03C",
      "created_at": "2022-03-27T14:59:47.493Z",
      "ensName": "크립토쿼카.eth"
    },
    {
      "plaintext": "Ethereum Address: 0xdf1A80841b16747Ea4A48F449a255a79f8E238dE\n\nDiscord Handle : queen jerry#7757\n\nTwitter Handle : https://twitter.com/cyptogangster\n\nStatement of Intention:\n\nMy View & Vision :\n\nHello, I first encountered coins in 2018. At first, it was only simple trading, but the more I learned about Bitcoin, the more I was surprised. It started with nft. Seeing that various functions are grafted onto nft (like dao, defi, loan, etc.), I felt that the possibilities of Bitcoin are limitlessAnd I believe it will become mainstream soon.Among them, I was interested in web 3.0.and I got to know Element Finance.Bringing a fixed speed protocol to the blockchain is essential, but Elemental Finance has it. That's the feature I was looking for.So I want to work with Element Finance\n\nMy qualifications / Skills\n\n1.No matter how good skills , marketing is essential. I'm confident I'll do it well\n\n2.Use Multiple chains so i understand the ecosystem of various chains\n\n3. I have experience with community mod\n\nI really hope to work with gsc.I want to share the beginning of this history with you. thanks",
      "commonwealthCommentId": 17826,
      "commonwealthName": "cocojerry",
      "commonwealthPostedFromAddress": "0xdf1A80841b16747Ea4A48F449a255a79f8E238dE",
      "address": "0xdf1A80841b16747Ea4A48F449a255a79f8E238dE",
      "created_at": "2022-03-27T10:29:05.369Z",
      "ensName": "jerrycoco.eth"
    },
    {
      "plaintext": "Hello everyone, I am requesting an application to be a Delegate and a Candidate for the GSC.\n\nEthereum Address：0xA25f2D38cB91F53136C25E553641E341D1cbd07f\n\nDiscord Handle ：Kudo Ω#8675\n\nTwitter Handle ： @ningquezaina\n\nStatement of Intention：\n\n 1. My View & Vision : As an early user who entered the blockchain in 2015, I have witnessed various changes and the shape of blockchain development. From the earliest consensus development of various public chains to ETH's smart contract and the gradually developing dapp ecosystem, from Earn to Build, now we have finally touched the most promising proposition - WEB3.0 . The development of web3 will inevitably merge web2, thus creating the Lego of Defi, the fusion of the Metaverse, the various forms of X-earn. Bringing fixed rate protocols to the blockchain is essential, just like Element. We can combine various tools such as Metaverse, Defi, NFT to complete the puzzle of web3 and create a new financial paradigm.\n\n2. The reason why i wanna be a Delegate and a Candidate for the GSC：Only in the form of Dao can we break through the restrictions of regions, national boundaries and concentration of power, participate in and build a decentralized and successful community Dao. This is a great exploration and I am very excited to be a part of it and contribute to the development of Element.\n\nWeb3 Qualifications / Skills：\n\n 1. Crypto VC Partner\n\n2. Participated in the internal testing of several early dapps and provided feedback\n\n3. Some early members of dao：Blanklessdao ，Opendao etc.\n\n4. Holder of crypto and participate in the design of some tokennomic projects\n\nI hope to contribute my ideas on Governance experimentation, Protocol improvements, Elfiverse design.",
      "commonwealthCommentId": 17825,
      "commonwealthName": "Ningque",
      "commonwealthPostedFromAddress": "0xA25f2D38cB91F53136C25E553641E341D1cbd07f",
      "address": "0xA25f2D38cB91F53136C25E553641E341D1cbd07f",
      "created_at": "2022-03-27T09:42:24.231Z",
      "ensName": "ningque.eth"
    },
    {
      "plaintext": "Ethereum Address : 0x5057b32E28E66a651524142f99411df9a751133D\n\nDiscord Handle : bongnam#0100\n\nTwitter Handle : @bongnam21\n\nReason for applying : I was interested in web3.0 early on, so I searched for projects related to web3.0. I have also served as an ambassador for ATA and has been involved with DAOs as a regional leader for Covalent. I would like to be part of the DAO of Element Finance and organize the DAO for the future of Web3.0.\n\n- My qualifications / Skills\n\n1. Treasury management\n\n2. Governance experimentation : ATA, Covalent, Derace, Hashflow\n\n3. Protocol improvements : Feedback of ATA, Covalent, Derace, Hashflow, Gamestarter, Elpis, ProjectSEED",
      "commonwealthCommentId": 17810,
      "commonwealthName": "bongnam",
      "commonwealthPostedFromAddress": "0x5057b32E28E66a651524142f99411df9a751133D",
      "address": "0x5057b32E28E66a651524142f99411df9a751133D",
      "created_at": "2022-03-26T16:50:46.386Z",
      "ensName": "0x5057b32e28e66a651524142f99411df9a751133.eth"
    },
    {
      "plaintext": "Hello Element Community, I am Wang, change agent and always happy to help!\n\nEthereum Address:  0x84fF4746E71e1c563b4D191368F6A91ea1648A47\n\nDiscord Handle:  wangjiaqi1989#8640\n\nTwitter Handle: @wangjaiqi1989\n\nI am an Element Finance protocol user and crypto technology enthusiast from Chinese community.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, Optimism&arbitrum, BSC, Heco, Polygon, Fantom, Solana, Terra and Cosmos(Secret network).",
      "commonwealthCommentId": 17805,
      "commonwealthName": "Wang",
      "commonwealthPostedFromAddress": "0x84fF4746E71e1c563b4D191368F6A91ea1648A47",
      "address": "0x84fF4746E71e1c563b4D191368F6A91ea1648A47",
      "created_at": "2022-03-26T13:49:32.606Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone, it's great to see Element's governance system thriving. I hope I can join the governance committee.\n\nEthereum Address:  0x10408AD1aB8A3ecEf36C16e56305d24C60559aC4\n\nDiscord Handle:  jkkhan48#9723\n\nTwitter Handle : @Jk11835911\n\nStatement of Intention\n\nIn the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally. Users can trade cryptocurrencies independently everywhere and also do not have to do KYC.\n\nTherefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills (optional)\n\n- Various chain practise: ETH, Polygon, BSC, Fantom, Solana, Terra and Cosmos etc.\n\n- Layer 2 based zksync actively participates & various web 3.0 projects such as uniswap, dydx.\n\n- Research, translation & Regional Commander at Riskharbor",
      "commonwealthCommentId": 17804,
      "commonwealthName": "joo",
      "commonwealthPostedFromAddress": "0x10408AD1aB8A3ecEf36C16e56305d24C60559aC4",
      "address": "0x10408AD1aB8A3ecEf36C16e56305d24C60559aC4",
      "created_at": "2022-03-26T12:02:52.616Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0x16269A8008f42feBd3025615E46efAB81D74dFB3\n\nDiscord Handle: ROWNA#9719\n\nTwitter Handle : @ROWNA01\n\nStatement of Intention\n\nCurrently, the financial markets are too centralized and show poor results.\n\nBecause of this, I continue to study DEFI and pass the information on DEFI to people in the market.\n\nWhile participating in element finance's DAO, I would like to participate in GSC as a member of the council to expand my influence in the Korean market, which has a large proportion in the global cryptocurrency market.\n\nI am also running a Korean crypto coin telegram, so I can actively participate. (https://t.me/Rowna999)\n\nWeb3 Qualifications / Skills (optional)\n\n1. Representative chains I have used are EHT, MATIC, Optimism, BSC, arbitrum, Fantom, cosmos, Gnosis, and solana.\n\n2. Layer 2 based zksync actively participates in Starkware ecosystem\n\n3. He participated in and contributed to various web3.0 projects such as uniswap, dydx, and paraswap.\n\n4. I participated in various dao systems. For example, Olympus dao",
      "commonwealthCommentId": 17803,
      "commonwealthName": "ROWNA",
      "commonwealthPostedFromAddress": "0x16269A8008f42feBd3025615E46efAB81D74dFB3",
      "address": "0x16269A8008f42feBd3025615E46efAB81D74dFB3",
      "created_at": "2022-03-26T11:33:22.884Z",
      "ensName": null
    },
    {
      "plaintext": "Hey guys hope everyone is doing well, this is my delegate application\n\nEthereum address: 0x483A1C4Bd20E8f7411B00412BE31215a13F6E18A (macgov.eth)\n\nTwitter handle: https://twitter.com/MacnBTC\n\nDiscord: Macnbtc #8263\n\nOn Twitter I’m mainly known from my technical analysis/shitposting and ass pictures but behind the scenes I have been involved in prod… actually let’s just keep it at shitposting and ass pictures (who cares anyways)\n\nLooking at the web3 DeFi stack there is an enormous gap in fixed yield markets and my bet is Element. After the element launch several competitors have popped up (pendle.fi etc lol) and so far none of these have come close to the superior AMM and product design of Element. With chad devs, investors and advisors I honestly believe Element won’t only fill and dominate the fixed and variable market gap but also scale out and dominate other domains. Why stop at fixed and variable yield markets when I could easily see Element issue its own stablecoin in the near future leveraging future yields & fixed rate maturities as collateral.\n\nReal reason I’m here is because I want to support my friend Windra, who I have known long before the Element days. Known about Element since it was just a sketch, given my input on hundreds of calls, seeded first pools, been shilling the element account since 45 followers, got all my CT friends to ape, and I’m probably top 15 heavy user and top 5 trader on https://ytc.component.fi/ by volume.\n\nI would like to be involved in the areas of treasury management + proposing and discussing protocol improvements and strategic initiatives.\n\nI appreciate the community’s consideration and I thank you for your time.",
      "commonwealthCommentId": 17801,
      "commonwealthName": "Mac",
      "commonwealthPostedFromAddress": "0x483A1C4Bd20E8f7411B00412BE31215a13F6E18A",
      "address": "0x483A1C4Bd20E8f7411B00412BE31215a13F6E18A",
      "created_at": "2022-03-26T07:34:37.708Z",
      "ensName": "macgov.eth"
    },
    {
      "plaintext": "Ethereum Address: 0x8E81Df3F82A10831E709899f61A84b3f7896D6E6\n\nDiscord Handle : way2wealth#5093\n\nTwitter Handle : @1way2wealth\n\nStatement of Intention:\n\nI intend to govern the protocol in such a way that:\n\n-we attract more TVL by explaining other DAOs how they can manage their treasury with predictable returns.\n\n-many new DeFi projects targeting fixed yield will be onboarded with enouragement to their founders/key members to join Element Financne and contribute\n\n-I will always strive to first increase the revenue of Element Finance followed by good distribution of profits to element community.\n\nI am working as a Software Development Project Manager and have a very good knowledge of Web3 as well. I am selected as \"community superhero\" for goodghosting and now helping (not working full time) them with community moderator role as well- performed extensive testing of their application and team appreciated my dedication and feedback which helped them make their product better. I have been part of active Notional Community and hold their old NFT as well along with being a winner of their DEFI contest as well. I am sure I will be able to do the justice with my role here as well.\n\nI am here to learn and learn faster by being open to suggestion n guidance from other community members as well. I would like to focus more on treasury management along with strategic initiatives.",
      "commonwealthCommentId": 17798,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0x8E81Df3F82A10831E709899f61A84b3f7896D6E6",
      "address": "0x8E81Df3F82A10831E709899f61A84b3f7896D6E6",
      "created_at": "2022-03-26T06:41:08.678Z",
      "ensName": null
    },
    {
      "plaintext": "BAYC的成功推出，是未来DAO治理的发展风向标，由此，我愿意贡献我个人的时间与精力同Element finance共发展,为社区成员谋福利。\n\nEthereum Address: 0xBc3C20aDe0daD0e3Ef486b56AD432eCFd030c7D7\n\nDiscord Handle:liaozuoxian#7406\n\nStatement of Intention:激励机制是推动一个项目可持续发展的前提，也是一个项目得以创新的一个不可或缺重要因素，很荣幸能接触到element finance这样真正想干事的项目，从去年7月份开始关注项目的每一步发展，每一个投资组合的推出，我希望能贡献我个人的一份力量帮助项目方一起发展，成长，为社区谋福利，为DEFI事业做出贡献非常感谢！",
      "commonwealthCommentId": 17796,
      "commonwealthName": "zuoxian L",
      "commonwealthPostedFromAddress": "0xBc3C20aDe0daD0e3Ef486b56AD432eCFd030c7D7",
      "address": "0xBc3C20aDe0daD0e3Ef486b56AD432eCFd030c7D7",
      "created_at": "2022-03-26T04:24:26.253Z",
      "ensName": "liaozuoxian.eth"
    },
    {
      "plaintext": "Ethereum Address: 0x63dfeAA5D75b848a8c70E826681bc3475670fbad\n\nDiscord Handle: panda#4343\n\nStatement of Intention:\n\nAs DAOs are decentralized autonomous organization,\n\neverything is based on code in blockchain which is transparency for anyone in the community\n\nwho're supposed to make the right decision to lead the protocol. I'm really interested to be part of it for long-term success in this project.\n\nWeb3 Qualifications / Skills:\n\n- Ethereum, BSC, Polygon, Solana explorer\n\n- Web3 Project galaxy dedication\n\n- Research & translation",
      "commonwealthCommentId": 17794,
      "commonwealthName": "panda",
      "commonwealthPostedFromAddress": "0x63dfeAA5D75b848a8c70E826681bc3475670fbad",
      "address": "0x63dfeAA5D75b848a8c70E826681bc3475670fbad",
      "created_at": "2022-03-26T04:02:57.753Z",
      "ensName": null
    },
    {
      "plaintext": "Hello everyone! here is my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0xEae9C2A2C803BEcbC81F3A485a7cdA9D03E33165\n\nDiscord Handle: aibobaby.eth#3774\n\nTwitter Handle: @jasonyu1840\n\nStatement of Intent:\n\nValues: community collaboration, dao principles, encryption spirit.\n\nVision: I hope element can continue the encryption spirit, return to the original intention of encryption on the basis of cooperation, collaboration and communication, and build a truly decentralized defi governance community.\n\nReason: DAO governance has always been a difficult problem in the currency circle. How to mobilize the enthusiasm of community members and let each member actively participate in community governance is a big problem, and how to avoid excessive centralization of the community and lead to the result of large players controlling the agreement is also worthwhile conseidered by every crypto project. Element does not implement community governance by issuing tokens like other projects, but has created a unique model, which is a brand new innovation in the currency circle. I am very excited about this and hope to be able to join such an interesting and professional team. In governance activities, I hope to grow and explore together with element to achieve true decentralized community governance.\n\nWeb3 qualifications/skills: Active contributors to the following DAOs/communities: across protocol rss3 dydx\n\nI am more interested in the Governance experimentation and am looking forward to joining Element Finance governance.",
      "commonwealthCommentId": 17791,
      "commonwealthName": "aibobaby",
      "commonwealthPostedFromAddress": "0xEae9C2A2C803BEcbC81F3A485a7cdA9D03E33165",
      "address": "0xEae9C2A2C803BEcbC81F3A485a7cdA9D03E33165",
      "created_at": "2022-03-26T02:48:26.083Z",
      "ensName": "aibobaby.eth"
    },
    {
      "plaintext": "gm fellow (soon-to-be) elves. I’m Nick.\n\nEthereum Address: 0x178249F0267612d85AB22335D5f7fF225D032034\n\n (elfiverse-servant.eth; Damn. Mommy, am I really that much of a tryhard?)\n\nDiscord Handle: _Nick#0010\n\nTwitter Handle: @0x_Nick_\n\nStatement of Intention:\n\nFrom the moment Charles posted “ An Introduction to Element’s Governance Model ” I knew that Element will be so much more than “just” a fixed rate protocol. (Which itself of course is super juicy already. I’m coming for you, ePyvcrvSTETH-1YEAR. Tax free yield/discount hopping from yearly term to yearly term will be real. At least in Germany.)\n\nBack to topic. Delegating ones voting power was always something I missed in EthFi (recent exceptions exist i.e. ENS). That is something I thought was pretty cool in the Cosmoverse, where validators can vote on behalf of their delegators. Over time however I noticed that the latter are not always really interested in governance discussions and their voting power can easily exceed their level of informed decision making. Additionally I also think that “ Governance benefits from a shared diversity of opinions and backgrounds ”, which is not necessarily the case with only node operators.\n\nThat - and so much more - is something the GSC structure can do better. I envision a system in which everybody can participate at their own capabilities, but at the same time still remains efficient with a continued high level of diversified decision making at its core.\n\nThat is also the reason why I would be delighted to take a more active role in Elements’ governance and represent some of you other elves. Not only to help shape the Elfiverse but also to push forward new governance innovations.\n\nI can’t confidently share such spectacular web3 resumes as others, but I can guarantee that I’m a solid degen at heart without being braindead. I spent quite a lot of time in Cosmoverse governance decisions (Cosmos, Sifchain, Osmosis) and would claim to be pretty solid in helping to converge different opinions to acceptable outcomes. That’s also a key area I’d like to focus on as a delegate. In that context I’d also like to concentrate on governance experimentation. I think I would also do a good job in contributing to strategic initiatives.\n\nbtw , shortly after the announcement I have secured the domains elfiverse.eth and elfiversefund.eth for us. Just in case they become of interest. If yes, those will of course be donated when the necessary structures are in place. It goes without saying that this is not related to me getting any votes or not. I’ll become a part of the elves either way.",
      "commonwealthCommentId": 17790,
      "commonwealthName": "Nick",
      "commonwealthPostedFromAddress": "0x178249F0267612d85AB22335D5f7fF225D032034",
      "address": "0x178249F0267612d85AB22335D5f7fF225D032034",
      "created_at": "2022-03-26T02:35:12.088Z",
      "ensName": "elfiverse-servant.eth"
    },
    {
      "plaintext": "Ethereum Address: 0x6CC8d0D7D085D9B5Ed8f685ea82DAf66cB9A5c63\n\nDiscord Handle: weiland#9567\n\nStatement of intention: I intend to become a member of GSC and contribute to the community, since I have a community of 500 people myself, I have used the Element protocol very early on, and have promoted the Element protocol to my community members.\n\nMy web3 qualifications / skills: My community has been involved in DeFi and DAOs for several years, many of the members are early participants and contributors to other projects and have provided a lot of constructive advice, playing a key role in these systems, I think if I join in, in It will play a great role in the follow-up work.",
      "commonwealthCommentId": 17789,
      "commonwealthName": "Weiland",
      "commonwealthPostedFromAddress": "0x6CC8d0D7D085D9B5Ed8f685ea82DAf66cB9A5c63",
      "address": "0x6CC8d0D7D085D9B5Ed8f685ea82DAf66cB9A5c63",
      "created_at": "2022-03-26T02:29:16.211Z",
      "ensName": null
    },
    {
      "plaintext": "Happy to apply elementfi’s GSC! Here's my application for being a GSC delegate & candidate.\n\nEthereum Address :\n\n0x15903dF309f04d1E4944cEb27499301C7e6D8e55\n\nTwitter Handle: @nftaper\n\nStatement of Intention:\n\nAs the oldest crypto influencer in Korea, he runs a channel. We are also operating the Definalist rule, the first research dao in the Korean market.\n\nThe Korean market occupies a very large proportion of the global crypto market. I would like to participate in GSC as a council member representing the Korean market.\n\nWeb3 Qualifications / Skills:\n\n- Various chain practise: ETH, Optimism&arbitrum, BSC, Heco, Polygon, Fantom, Solana, Terra and Cosmos(Secret network).\n\n- Nansen Alpha member.\n\n- Research, translation & Regional Commander at Riskharbor",
      "commonwealthCommentId": 17787,
      "commonwealthName": "Definalist",
      "commonwealthPostedFromAddress": "0x15903dF309f04d1E4944cEb27499301C7e6D8e55",
      "address": "0x15903dF309f04d1E4944cEb27499301C7e6D8e55",
      "created_at": "2022-03-26T02:10:56.673Z",
      "ensName": "paradigmxyz.eth"
    },
    {
      "plaintext": "Ethereum Address:  0x867181B1aDe6A7b08226fb1506F64BfacAdea4D1\n\nDiscord Handle:  sarabayat#1202\n\nStatement of Intention:\n\nDAOs were designed to be decentralized and automated. Based on open-source code, it acted as a venture capital fund without a typical management structure or board of directors. Since the DAO was decentralized, it was unaffiliated with any particular nation-state, though it made use of the Ethereum network\n\nWeb3 Qualifications / Skills:\n\ncomputer engineering\n\nFront End Web Developer\n\nDesigner\n\nReactjs\n\nPython\n\nOOP\n\nJAVA",
      "commonwealthCommentId": 17782,
      "commonwealthName": "sara bayat",
      "commonwealthPostedFromAddress": "0x867181B1aDe6A7b08226fb1506F64BfacAdea4D1",
      "address": "0x867181B1aDe6A7b08226fb1506F64BfacAdea4D1",
      "created_at": "2022-03-25T22:09:35.147Z",
      "ensName": "masterpeace.eth"
    },
    {
      "plaintext": "Ethereum Address : 0xDaC0B6F3b00c159FC26CD9E153D7f0E60597e207\n\nDiscord Handle (optional) : demaks#1186\n\nStatement of Intention:\n\n As you see, financial institutions have a great deal of power if their efficiency is not high. As a result of the government's creation of operating institutions, the people trust them, and as a result, they create conflicts between people that the government resolves. However, trust in government and intermediary institutions does not guarantee that they function properly . Various fiscal policies have increased inflation, devalued people's assets, and ultimately collapsed the economy. DEFI focuses on providing the same services to banks, insurance companies, and other centralized financial institutions without the need for trust in a specific person or entity and relying on the security of China's Blockchain technology .\n\n Web3 Qualifications / Skills :\n\n 1 - fullstack web developer ( php-vuejs-laravel / nodejs-reactjs-mongodb)\n\n 2 - Active contributor in some DAOs\n\nUniswap\n\nOlympusDAO\n\nParaswap\n\nENS\n\nDyDx\n\n 3 - work with some Various chain like ETH, BSC, Polygon, Fantom, Solana, Terra , Avalanch , celo , ...\n\n4 - work with ETH layer2 like optimism , arbitrum , zksync , loopering , starkware .\n\n5 - participate in web3 project like zapper , zerion , match , slingshot , paraswap , uniswap , dydx\n\n6 - Enthusiast about security and blockchain",
      "commonwealthCommentId": 17780,
      "commonwealthName": "demaks",
      "commonwealthPostedFromAddress": "0xDaC0B6F3b00c159FC26CD9E153D7f0E60597e207",
      "address": "0xDaC0B6F3b00c159FC26CD9E153D7f0E60597e207",
      "created_at": "2022-03-25T21:57:53.299Z",
      "ensName": "goldenbit.eth"
    },
    {
      "plaintext": "GM fellow elves,\n\nI go by the name Bankloos and am looking forward to contribute to the DAO as a GSC member/delegate.\n\nEthereum address: 0xF7791248951DA4F9221fe4EfA0a3a9825B48861D\n\nDiscord Handle: Bankloos.eth#1457\n\nTwitter Handle: @CryptoKleij\n\nStatement of Intention:\n\nValues: Transparency, integrity, decentralization, education\n\nVision:\n\nI have had a massive interest and passion for DAOs and governance ever since the first DAO on Ethereum before it got hacked. This interest has only grown the past couple of years with the massive growth we have seen in the Web3 space. However, as most of us know, most DAOs suffer from heavy centralization of voting power based on user activity or amount of capital (tokens held). With the introduction of Element’s voting vaults and fully modular governance system I’m very excited to start experimenting in what will hopefully be a truly decentralized and community owned protocol.\n\nReason why I want to become a delegate/GSC Member:\n\nI believe heavily in the future of DeFi, but at the same time this space needs a lot of maturing. I believe Element Finance is at the forefront of this shift, offering attractive high fixed rate yields. In addition, I think Element’s GSC model could be the next major breakthrough for DeFi governance and act as a building block.\n\nWeb3 Qualifications / Skills:\n\nHave worked as a community manager for numerous protocols since 2017\n\nWas part of the first DAO on Ethereum\n\nChemical engineer that is now studying Business Administration (graduating next year)\n\nActive contributor in the following DAOs/Communities:\n\n[REDACTED] Cartel\n\nColony Network\n\nOlympusDAO\n\nMakerDAO\n\nGRO\n\nBalancer\n\nCurve\n\nCurvance\n\nI think I can help with community management, strategic initiatives, DAO to DAO partnerships and treasury management. I’m a heavy user of Element and am looking forward to seeing our DAO launch. The future for Element seems incredibly bright!",
      "commonwealthCommentId": 17776,
      "commonwealthName": "Bankloos",
      "commonwealthPostedFromAddress": "0xF7791248951DA4F9221fe4EfA0a3a9825B48861D",
      "address": "0xF7791248951DA4F9221fe4EfA0a3a9825B48861D",
      "created_at": "2022-03-25T19:48:06.796Z",
      "ensName": null
    },
    {
      "plaintext": "GM fellow elves,\n\nI go by the name Bankloos and am looking forward to contribute to the DAO as a GSC member/delegate.\n\nEthereum address: 0xF7791248951DA4F9221fe4EfA0a3a9825B48861D\n\nDiscord Handle: Bankloos.eth#1457\n\nTwitter Handle: @CryptoKleij\n\nStatement of Intention:\n\nValues: Transparency, integrity, decentralization, education\n\nVision:\n\nI have had a massive interest and passion for DAOs and governance ever since the first DAO on Ethereum before it got hacked. This interest has only grown the past couple of years with the massive growth we have seen in the Web3 space. However, as most of us know, most DAOs suffer from heavy centralization of voting power based on user activity or amount of capital (tokens held). With the introduction of Element’s voting vaults and fully modular governance system I’m very excited to start experimenting in what will hopefully be a truly decentralized and community owned protocol.\n\nReason why I want to become a delegate/GSC Member:\n\nI believe heavily in the future of DeFi, but at the same time this space needs a lot of maturing. I believe Element Finance is at the forefront of this shift, offering attractive high fixed rate yields. In addition, I think Element’s GSC model could be the next major breakthrough for DeFi governance and act as a building block.\n\nWeb3 Qualifications / Skills:\n\nHave worked as a community manager for numerous protocols since 2017\n\nWas part of the first DAO on Ethereum\n\nChemical engineer that is now studying Business Administration (graduating next year)\n\nActive contributor in the following DAOs/Communities:\n\n[REDACTED] Cartel\n\nOlympusDAO\n\nMakerDAO\n\nGRO\n\nBalancer\n\nCurve\n\nCurvance\n\nI think I can help with community management, strategic initiatives, DAO to DAO partnerships and treasury management. I’m a heavy user of Element and am looking forward to seeing our DAO launch. The future for Element seems incredibly bright!\n\n(image)",
      "commonwealthCommentId": 17775,
      "commonwealthName": "Bankloos",
      "commonwealthPostedFromAddress": "0xF7791248951DA4F9221fe4EfA0a3a9825B48861D",
      "address": "0xF7791248951DA4F9221fe4EfA0a3a9825B48861D",
      "created_at": "2022-03-25T19:46:00.783Z",
      "ensName": null
    },
    {
      "plaintext": "Good day, here's my application for becoming a GSC delegate & candidate.\n\nEthereum Address: 0x7c199031de580ECb75D5aE0bdeBBFE2e23b4BBAE\n\nDiscord: vva#2123\n\nTwitter Handle: @golftel\n\nStatement of Intention:\n\n In the recent years, Crypto and blockchain are gradually growthing and there're a lot of use cases at the moment. DeFi has a wide range of products that serve everyone unconditionally. Users can trade cryptocurrencies independently everywhere and also do not have to do KYC.\n\n Therefore, it's clear that decentralization is truly people's power.\n\nThere's no barrier of gender, nation, income, and etc. This is really opportunity for those who're interested and that's why I want to be part of Members of the Governance Steering Council and carefully make the right\n\nchoice of voting or decision to make the project go ahead efficiency.\n\nWeb3 Qualifications / Skills:\n\n - Various chain practise: ETH, BSC, Polygon, Fantom, Solana, Terra and Cosmos.\n\n - Yield farming, trading, delta neutral.\n\n - Research & translation: Curvance\n\n - MarketingDAO: Kwenta",
      "commonwealthCommentId": 17757,
      "commonwealthName": "vva",
      "commonwealthPostedFromAddress": "0x7c199031de580ECb75D5aE0bdeBBFE2e23b4BBAE",
      "address": "0x7c199031de580ECb75D5aE0bdeBBFE2e23b4BBAE",
      "created_at": "2022-03-25T07:55:41.129Z",
      "ensName": null
    },
    {
      "plaintext": "Ethereum Address: 0xA87b950E831207631de8A1d5ac01afC7391ED2ef\n\nTwitter Handle:  ljxie\n\nStatement of Intention:\n\nOne of the most important goals in life for me is to help enable equality of opportunity for people regardless of where they live. DeFi and decentralized governance are critical parts of moving this forward and I believe the Element team and community are pioneers in both so I’m excited to be able to participate and help support.\n\nWeb3 Qualifications / Skills:\n\nWorked in the crypto space for the past 8 years\n\nCo-founded a crypto fund that backed many teams including Element and other DeFi protocols\n\nCo-producer on the documentary Ethereum: The Infinite Garden\n\nPreviously early employee and product manager at Coinbase\n\nMember of the Gitcoin Steward Council\n\nMember of the dYdX Grants Program committee\n\nEarly advisor of 0x\n\nI would like to focus on governance experimentation, protocol improvements, and strategic initiatives.",
      "commonwealthCommentId": 17752,
      "commonwealthName": "Linda Xie",
      "commonwealthPostedFromAddress": "0x5e349eca2dc61aBCd9dD99Ce94d04136151a09Ee",
      "address": "0xA87b950E831207631de8A1d5ac01afC7391ED2ef",
      "created_at": "2022-03-25T02:45:04.811Z",
      "ensName": null
    },
    {
      "plaintext": "Hello 👋 I am BEW and am running for the Element GSC. Thanks for taking the time to read through my statement!\n\nEthereum Address: 0x9B338FdDc58A3A28042ff3Fc9Ae3eCbcFE0de267\n\nDiscord Handle: 0xBEW | Yunt Capital#9379\n\nTwitter Handle: @0xBEW\n\nWeb3 Koalafications 🐨\n\nFounding member of Yunt Capital, an early stage crypto native venture capital firm\n\nElected as Emissary Prime for the Echelon Prime Foundation. The Echelon Prime Foundation is building a decentralized Play-to-Earn ecosystem. Our $PRIME token will be utilized by games and tools within the ecosystem, starting with Parallel TCG. Parallel is an NFT based trading card game.\n\nCogent (hopefully!) writer who has published on a variety of topics within the broader crypto space. You can find my writing here: https://medium.com/@0xbewdev\n\nStatement of Intent\n\nThe Element protocol has been a needed Lego brick in the broader DeFi primative landscape. As I have pointed out before, fixed rates and interest rate swap markets are a crucial component of well functioning financial systems around the world. For DeFi to achieve what we all believe it can a protocol like Element will be needed.\n\nThat said we’re still very much in the infancy of DeFi in general and the Element protocol in particular. In these early days it will be crucial to establish a set of processes for how the protocol is governed, and to define the standards by which GSC members are held. As one of the earliest members of the Element community and an investor in Element Finance I bring a unique perspective that will be valuable as we chart a course for Element as a decentralized protocol. Through my experience as as one of the eleven elected Emissaries for the Echelon Prime Foundation (a decentralized Play-to-Earn ecosystem) I know what it takes build solid foundations that will outlast those of us who first serve on the council.\n\nCrucial issues that will need to be tackled from the start include:\n\nEstablishing a constitution or charter by which we as potential GSC members can be held accountable\n\nDetailing standards for operational items such as grant requests, Council compensation, on-boarding new treasury management partners, and community communication such as weekly newsletters, office hours and more formal community calls\n\nIdentifying strategic partners who can work with the GCS to build out new and novel user facing applications on top of the Element protocol\n\nIf elected I will operate as a proxy for Yunt Capital. As early investors, protocol users and community members we collectively are deeply invested in the success of the Element protocol. As crypto native degens, rolling up our sleeves and getting right into it with protocols we invest in is in our DNA. We are no strangers to bootstrapping governance with our partners and are excited to bring our breadth of experience, expertise and connections to the Element GSC. Finally, many of the core values of the Element protocol such as eagerness to experiment and a passion for building inclusive community mirror our own closely held ethos at YC. With this in mind we’re grateful for the opportunity to continue to help shape a protocol we love and ask for your consideration when deciding how to delegate votes for GSC!",
      "commonwealthCommentId": 17750,
      "commonwealthName": "BEW",
      "commonwealthPostedFromAddress": "0x9B338FdDc58A3A28042ff3Fc9Ae3eCbcFE0de267",
      "address": "0x9B338FdDc58A3A28042ff3Fc9Ae3eCbcFE0de267",
      "created_at": "2022-03-25T01:00:29.574Z",
      "ensName": null
    },
    {
      "plaintext": "Hi I’m Re’em and I’m an Element Finance connoisseur.\n\nThank you in advance for your time in reading my delegate application.\n\nEthereum Address: 0x0d52e0639c49Efbf8E74Ab38E7d7f48089F04ef3 (rmrf.eth)\n\nDiscord Handle: Re’em ראם 大公羊#7665\n\nTwitter Handle: @re_emsal\n\nStatement of Intention:\n\nRelentless dedication and conviction for Element Finance are two strong attributes that describe my intentions seeking to be delegated as a GSC member. As an early community member, contributor and friend I’ve been privileged to see the growth of the team and protocol.\n\nAs a result of my observance and continued involvement my candidacy brings me to the next viable step in further providing value and realizing the long term self-sustainable vision for the Element Finance Protocol.\n\nCurrently I am the Head of Product and Co-founder at Component, we serve as a Web3 R&D company building tools, products and protocols specifically with blockchain data. We’ve previously launched the “Yield Token Compounding” tool and will continue contributing to Element.\n\nIn regards to my values, I follow core principles to a fault around integrity, brutal honesty, rationality and critical thinking. Immense responsibility keeps it important to hold myself to these standards. But I also make sure to not take myself too seriously all the time so I can have fun .\n\nObjective:\n\nElement Finance’s fixed rate protocol will extend the bounds of our current DeFi market with an obvious inclination towards more risk-averse strategies from TradFi. In reality, for large scale adoption and for good faith regulator engagement, governance itself needs to be resilient, well organized, operated efficiently and end-to-end systematic. These goals are idealistic, but require extensive experimentation and implementation in order to slowly but surely be worked towards for self-sustainability. This increases my belief that Council Protocol’s architecture and given modularity is a true gift to the governance stack.\n\nMy interests in terms of involvement as a GSC member are the following:\n\nGovernance Experimentation\n\nCollaborating to build out frameworks and possibly an environment for Element governance experimentation.\n\nExperimentation and research to further governance automation and security.\n\nOperations\n\nBootstrapping and organizing proper operational structure for aspects such as compensation, accounting, compliance, communication and contribution.\n\nGrants Program\n\nInitializing a grants program strategically around the growth of the protocol network and benefit of community members.\n\nSupporting any grantees and community builders.\n\nTreasury Management\n\nInvolvement in modeling treasury management frameworks in collaboration with 0xBew (Yunt Capital) and other interested parties.\n\nIn conclusion, I plan to spend a substantial amount of my time contributing to the legwork and continuing needs to reach governance and protocol excellence.\n\nFeel free to reach out to me if you have any questions regarding my application or anything Element 😊.\n\n*Disclaimer - as an executive member of Component, Inc. I will uphold impartiality towards any proposals put forth by my party in the future*",
      "commonwealthCommentId": 17733,
      "commonwealthName": "Re'em Sal",
      "commonwealthPostedFromAddress": "0x0d52e0639c49Efbf8E74Ab38E7d7f48089F04ef3",
      "address": "0x0d52e0639c49Efbf8E74Ab38E7d7f48089F04ef3",
      "created_at": "2022-03-24T16:52:20.556Z",
      "ensName": "rmrf.eth"
    },
    {
      "plaintext": "Hi elves! I hope I can join as a delegate and potencial GSC member.\n\nEthereum address : 0xd9898Fe5707936874316023d74aE9d723f31fb3A\n\nStatement of Intention: DeFi savvy user and been around crypto industry for some time now. I tend to interact with most protocols as a user/investor and try to engage with the community of the ones I consider more interesting. Element is one of those.\n\nAlthough I don't have professional experience working in web3, I do have in web2 working in sales and product marketing teams and this is where I believe I can contribute more, helping setting up processes.\n\nAreas of interest:\n\nBiz Dev\n\nOperations\n\nStrategic Initiatives\n\nProduct Marketing",
      "commonwealthCommentId": 17729,
      "commonwealthName": null,
      "commonwealthPostedFromAddress": "0xd9898Fe5707936874316023d74aE9d723f31fb3A",
      "address": "0xd9898Fe5707936874316023d74aE9d723f31fb3A",
      "created_at": "2022-03-24T16:38:19.205Z",
      "ensName": null
    },
    {
      "plaintext": "Sup elves!\n\nEthereum address : ivangbi.eth / 0x7BAFC0D5c5892f2041FD9F2415A7611042218e22\n\nDiscord handle : ivangbi 👾#4318\n\nTwitter handle : ivangbi_ (it's everywhere else without the \"_\", Jack Dorsey rugged my first account)\n\nBackground / skills: i am a shitposter , to the extent it's almost a profession. Was on marketing role in 2018, then in 2019-2020 on a B2B blockchain project (don't ask me how that happened, but it was a lovely community). I've mostly been shitposting in lobsterdao for over 2 years, and since Feb 2021 - one of the founding members at Gearbox Protocol. We did a cool tech call w Element team a few weeks back , you might find it interesting actually.\n\nOk smurfs, I have a few reasons to be here:\n\nMy airdrop needs to go up\n\nWindra and Mihai promised to murder me if I do not apply\n\nI need to list my shitcoins to be pumped via Element protocol\n\nOk now real reasons to propose my candidacy :\n\nI like to keep on top of things in DeFi due to the nature of my occupation, so might have a diverse perspective on topics. Likely not very useful in matters of tech, but have done a fair share of multisig'ing, DAO operational work, community and FUD combat (not quite the Bruce Li, but aspiring to be).\n\nElement Finance team (and soon DAO) are huge brains, and I'd love to somehow be in this journey and help shape it. Whether I'll be able or not is yet to be seen.\n\nWould most likely be fit for strategy / treasury / governance topics. Not enough brains to access risk in onboarding assets or protocol architecture, but will keep an eye out.\n\nPS: James is cool. His proposal is above.",
      "commonwealthCommentId": 17718,
      "commonwealthName": "ivangbi",
      "commonwealthPostedFromAddress": "0x7BAFC0D5c5892f2041FD9F2415A7611042218e22",
      "address": "0x7BAFC0D5c5892f2041FD9F2415A7611042218e22",
      "created_at": "2022-03-24T15:06:43.665Z",
      "ensName": "ivangbi.eth"
    },
    {
      "plaintext": "Hello, Element Community, I'm Anda. Please let me be the representative and GSC member, I introduce myself.\n\nEthereum Address: 0x6C2b9696627612FB7656ABEC3b0E9Ce4c6E98B64\n\nDiscord Handle: anda#9305\n\nTwitter Handle: @anda87403007\n\nI love the element's governance framework, where anyone can easily participate in shaping the element's direction. Innovative, open, inclusive, and flexible. I'm involved in a lot of DAO experiments and have more than enough time to work, so I hope to fit in and contribute to the element community.",
      "commonwealthCommentId": 17692,
      "commonwealthName": "anda",
      "commonwealthPostedFromAddress": "0x6C2b9696627612FB7656ABEC3b0E9Ce4c6E98B64",
      "address": "0x6C2b9696627612FB7656ABEC3b0E9Ce4c6E98B64",
      "created_at": "2022-03-24T11:58:48.429Z",
      "ensName": "andajun.eth"
    },
    {
      "plaintext": "Hello Element Community,\n\nI wish to become a delegate of Element Finance and take part into the decentralized governance.\n\nEthereum Address: 0xCfAdF643fC9a9D978451B135e6e6C62B28fb6545\n\nDiscord Handle: luxebeng#1699\n\nTwitter Handle: @liuxingbing\n\nBeing an Element Finance protocol user, I firmly believe in that Element makes DeFi better and will devote myself to the great project.\n\nAs a delegate, I will take part into governance experimentation and protocol improvements. Further providing services and support to locals users merging into Element community.",
      "commonwealthCommentId": 17683,
      "commonwealthName": "luxebeng.eth",
      "commonwealthPostedFromAddress": "0xCfAdF643fC9a9D978451B135e6e6C62B28fb6545",
      "address": "0xCfAdF643fC9a9D978451B135e6e6C62B28fb6545",
      "created_at": "2022-03-24T10:34:17.946Z",
      "ensName": "luxebeng.eth"
    },
    {
      "plaintext": "Hi element community admins, let me present myself for the call for delegates and GSC members.\n\nEthereum address: 0xE93E76578f1ee7CC998368C50875Fa00C775faa9\n\nDiscord Handle: Cryptogold #5909\n\nTwitter Handle: @xxg970307\n\nStatement of Intent:\n\nI deeply understand the importance of GSC members to the community, I mustered up the courage to apply, and made the following introduction, I am a 25-year-old Chinese, and I began to participate in the cryptocurrency field when I was in college at the age of 20. At the beginning of contact, this Things are very complicated, but as I went deeper, I began to like this field, but with the development of cryptocurrencies and the increase in the projects I participated in, various problems began to emerge, and I also tried to find a better To solve the problem, many loan projects or mining dex in the market help users provide a mining platform, but there is a problem, it cannot achieve a constant fixed annual interest rate, and for users, it is impossible to follow The same fixed annual interest rate platform as a bank, but element can be realized. At the same time, large-scale funds will be the main customers in the future, and large-scale funds customers are more risky and conservative. Personally, I don’t have much time to participate in more projects, but I am going to participate in element, because I think that developing AMM for principal token may be a more correct approach than pendle. At the same time, it has launched a business line of \"treasury management\". Any defi protocol or dao can make low-risk investment! This means unlimited potential for the future!\n\nMy web3 qualifications/skills:\n\nI think I can help in different areas.\n\nI am an early user of uniswap, and served as a community mod in multiple dex such as kanaswap. I am the highest contributor in the jediswap community, and I have also served as the admin helper of nfts such as voiceserver. Participated in early testing of gearbox.\n\nI've been using the Element protocol since the beginning and sharing it with our crypto square community and sending suggestions as I do so.\n\nAs a heavy user of Element, with the improvement of the protocol, we will serve community users well, help to screen in-depth customers and maintain them, and educate early users.\n\nAt the same time, I have participated in the construction of dao. I think the problem that element's dao construction should be avoided: not everyone who joins the server is a member of DAO, nor should it. Different levels of community participation have different privileges and expectations, which are harmful to the community to confuse them. Some want to participate in will, while others are looking for full-time employment. Some join the casual, while others aim to unravel the thorns of decentralized governance. Therefore, team leaders should be clearly convened to identify a single-responsibility approach to implementation. These leads are Team Champions, Workflow Leaders and Project Managers. They are not responsible for themselves, but they are the core and key coordination point for the cessation of responsibility. This is also the responsibility of GSC members, I think it is necessary to think about how to be a mature and efficient dao, as you can see, most of the dao represent inefficiency.\n\nI have studied CPA and frm, and have certain risk awareness and financial awareness.\n\nThanks for your time and look forward to helping with this amazing project.",
      "commonwealthCommentId": 17678,
      "commonwealthName": "xuxiangeng",
      "commonwealthPostedFromAddress": "0xE93E76578f1ee7CC998368C50875Fa00C775faa9",
      "address": "0xE93E76578f1ee7CC998368C50875Fa00C775faa9",
      "created_at": "2022-03-24T10:08:21.050Z",
      "ensName": null
    },
    {
      "plaintext": "I hope to become a delegate of Element Finance on the great journey towards decentralized governance.\n\nEthereum Address: 0xA59A3418A459EbeECAd43b4C6B9322C626BF8486\n\nDiscord Handle: crazystone#2773\n\nTwitter Handle: @crazyst44808201\n\nI am an Element Finance protocol user and crypto technology enthusiast from Chinese community. I am willing to use my enthusiasm and skills to bring services and support to Chinese users participating in Element decentralized governance. I firmly believe that crypto makes finance better and Element makes crypto better.\n\nAccording to the actual situation of my work, as a delegate, I will participate in the governance process from the following aspects:\n\nTreasury management&Asset onboarding&Strategic initiatives",
      "commonwealthCommentId": 17646,
      "commonwealthName": "crazystone",
      "commonwealthPostedFromAddress": "0xA59A3418A459EbeECAd43b4C6B9322C626BF8486",
      "address": "0xA59A3418A459EbeECAd43b4C6B9322C626BF8486",
      "created_at": "2022-03-24T06:03:12.335Z",
      "ensName": null
    },
    {
      "plaintext": "GM, everyone!\n\nEthereum Address:  0xbb67bce8d0e63082a5a349b35439f14c167e08f6\n\nDiscord Handle:  xiangguacheng#8563\n\nTwitter Handle: @liangkuaiqian\n\nI very much hope to become a member of the governance committee. I used to be an ambassador in other projects (zecrey, synfutures), and made my own contributions to community governance, which was affirmed by members.",
      "commonwealthCommentId": 17642,
      "commonwealthName": "liangkuaiqian",
      "commonwealthPostedFromAddress": "0x426E5d7f02b076c4F26Ce073C3280090CBdA2775",
      "address": "0xbb67bce8d0e63082a5a349b35439f14c167e08f6",
      "created_at": "2022-03-24T05:01:04.529Z",
      "ensName": "huangchen.eth"
    },
    {
      "plaintext": "Hello Element Community, I am Bassey Udo, change agent and always happy to help!\n\nEthereum Address: 0x7f8c1877Ed0DA352F78be4Fe4CdA58BB804a30dF\n\nDiscord Handle: laurels#5517\n\nTwitter Handle: @ba33ey\n\nStatement of Intention: I intend to be a part of GSC to add valuable and strategic contributions and make ELF innovative governance and ecosystem efficient, reliable and sustainable via supporting and voting progressive proposals. I value simplicity, honesty, excellence, innovation, shared ideas, teamwork and decentralization.\n\nWeb3 Qualifications / Skills: First ENS reg. 2019, UNI 400 recipient, OCEAN DAO member, Market Research, Analytics, Money Management, Collaboration.\n\nDelegate Area: I desire to join Treasury Management and would appreciate your consideration and acceptance.\n\nThank you!",
      "commonwealthCommentId": 17640,
      "commonwealthName": "Bassey U.",
      "commonwealthPostedFromAddress": "0x7f8c1877Ed0DA352F78be4Fe4CdA58BB804a30dF",
      "address": "0x7f8c1877Ed0DA352F78be4Fe4CdA58BB804a30dF",
      "created_at": "2022-03-24T04:23:17.245Z",
      "ensName": "datanft.eth"
    },
    {
      "plaintext": "Defieye Community Application:\n\nHi, putting a GSC application on behalf of defieye community!\n\nStatement of intention:\n\nDeFiEye community, founded by crypto researcher Defi Teddy, is one of the most influential Asian crypto investment communities. The founding members also include early Bitcoin investors, Wall-street traders and engineers from Silicon Valley.\n\nDeFiEye community provides members with\n\n- free DeFi/Web3 education,\n\n- open-source data and analytics tools (e.g., our bridgeeye tool https://gitcoin.co/grants/4655/defieye-cross-bridge-tool is one of the most popular grants in GR13)\n\n- daily alpha news\n\nOur partners include\n\n- well-known projects such as Decentraland, Avalanche, Algorand, Synthetics, Mask networks, Near Protocol, Celer Networks etc.\n\n- top-tier VCs such as Haskey Capital， IOSG\n\n- medias such as Cointelegraph, Block Beats, PANews, Winkrypto\n\nWe want to contribute beyond investment. We want to make more contributions to the defi world. Governance and decentralization are significant for a protocol like Element so we want to be a GSC member to let more people be aware of the importance of governance and improve engagement in governance!\n\nTwitter: https://twitter.com/defieye_io\n\nDefi education site: https://guide.defieye.io\n\n DeFi tools: https://tools.defieye.io .\n\nEthereum address: 0xBA08B6b663Cdc75684b669540408bA54D9eC61fD",
      "commonwealthCommentId": 17635,
      "commonwealthName": "dillon",
      "commonwealthPostedFromAddress": "0x1BF555E99b9056e75F5752EBF6593C4929BF5d50",
      "address": "0xBA08B6b663Cdc75684b669540408bA54D9eC61fD",
      "created_at": "2022-03-24T02:07:43.437Z",
      "ensName": null
    },
    {
      "plaintext": "Hi Element Community. Let me present my self for the call for Delegates & GSC Members.\n\nEthereum Address: 0x3e0cf03f718520F30300266dcF4DB50bA12d3331\n\nDiscord Handle JesusPerez (Crypto Plaza)#0299\n\nTwitter Handle @especulacion\n\nStatement of Intention:\n\nOne of my battles for a long time has been trying to explain that improving financial services is probably one of the most social goals we can pursue. It is important to understand that when we invest, in most cases we are supporting other people who start their ideas.\n\nThat the highest degree of financial development correlates with more wealth for society. That the markets allow us to coordinate much better. That this coordination is necessary to advance and create value as a society\n\nWhen we work to create a project like Element we are improving the financial world and with it our society, it is not a mere exercise in speculation. Element is a protocol that allows risk sharing with different agents to delegate in the agents that can afford it.. Enabling these services to be universal and inclusive.\n\nIt is a job that I would like to be a more active part of, but I will be happy to help from any position.\n\nMy web3 qualifications / skills:\n\nFrom the beginning I have been using the Element protocol and sharing it with our crypto plaza community, as well as sending suggestions when doing so.\n\nI am a Computer Engineer that has been working in Financial Institutions and launching financial startups, last 5 years focus in Crypto/DeFi. I am ambassador of MakerDAO, and participating actively in communities like Balancer, Enzyme, Superfluid, Unslashed, Perpetual or Potion Finance.\n\nI have work in the tokenomics of several projects like Climate Trade, Ethichub, EasyFeedback, Tutellus. Leading Roble Venture Capital, one of the most active VC in Crypto in Spanish Ecosystem.\n\nFounder of Crypto Plaza, one of the largest Spanish Communities that usually translate and promote DeFi . Founder of the Spanish Fintech Association that has promote regulatory Sandbox in Spain, where Crypto Projects are applying in Spain. Founder of the IberoAmerica Fintech Aliance.\n\nI think I can help in differente areas, like Strategic Initiatives and also y treasury management. And happy to can represent all the Element community in the more transparent way. And following with the protocol improvement as a heavy user of Element.\n\nThanks for your time, and looking forwar to can help in this amazing project.",
      "commonwealthCommentId": 17629,
      "commonwealthName": "Jesus Perez Sanchez",
      "commonwealthPostedFromAddress": "0x3e0cf03f718520F30300266dcF4DB50bA12d3331",
      "address": "0x3e0cf03f718520F30300266dcF4DB50bA12d3331",
      "created_at": "2022-03-24T00:19:02.642Z",
      "ensName": null
    },
    {
      "plaintext": "\nHey all,\n\nPutting forth a delegate application on behalf of 🔥_🔥 [(Fire Eyes DAO)](https://www.fireeyes.xyz/).\n\nEthereum Address: 0x7c1ba969b47c7b189eee10bcc11d6e8897fd97c3\n\nDiscord Handle: BlockchainJames#1665\n\nTwitter Handle: @blockchainjames\n\n### Statement of Intention\n\n🔥_🔥 (Fire Eyes DAO) is a huge supporter of Element Finance and the DeFi primitives it enables. As governance stewards across the space, 🔥_🔥 is excited to participate in Element Governance and the GSC structure!\n\n🔥_🔥 values all experimentation within the token and governance landscape and transparency above all.\n\nCheck out the [Wildfire annoucement](https://twitter.com/blockchainjames/status/1493658329192804355) which includes Element and look out for a blog post outlining more detail about 🔥_🔥 x Element coming soon 👀\n\n### My web3 qualifications / skills:\n\n🔥_🔥 is focused on experimenting and participating within the DAO universe. Collectively, 🔥_🔥 members are regular contributors to a diverse range of organizations playing critical roles in the development of the DeFi and DAO ecosystem.\n\n🔥_🔥 is comprised of 4 members:\n\n[James Waugh](https://twitter.com/blockchainjames)\n\n[Callum Gladstone](https://twitter.com/gladstonecallum)\n\n[Cooper Turley](https://twitter.com/Cooopahtroopa)\n\n[Lucas Campbell](https://twitter.com/0x_lucas)\n\n🔥_🔥 are active contributors to many impact driven web3 communities including: MetaCartel, MetaCartel Ventures, Bankless DAO\n\n🔥_🔥 has worked on a handful of impactful projects across the ecosystem, including: [Aave](https://medium.com/fire-eyes-dao/hello-world-e3c9a409ea49?source=collection_home---4------5-----------------------), [Rocket Pool](https://medium.com/fire-eyes-dao/fire-eyes-x-rocket-pool-rpip003-367a89af5a64?source=collection_home---4------3-----------------------), [Balancer](https://medium.com/fire-eyes-dao/x-balancer-4249df3f68c6?source=collection_home---4------2-----------------------), [ENS](https://mirror.xyz/james.eth/XkOIGh8xu_bF2cQV4QZkKxoN0o1OuNoEb3o-Nzjdo3I), [Gitcoin](https://medium.com/fire-eyes-dao/x-gitcoin-d172ebfbb60f?source=collection_home---4------1-----------------------), [SuperRare](https://medium.com/fire-eyes-dao/x-superrare-736ab1d090a4?source=collection_home---4------0-----------------------) as well as many others!\n\n\n",
      "commonwealthCommentId": 17625,
      "commonwealthName": "James 🔥_🔥",
      "commonwealthPostedFromAddress": "0x6Dc43be93a8b5Fd37dC16f24872BaBc6dA5E5e3E",
      "address": "0x7c1ba969b47c7b189eee10bcc11d6e8897fd97c3",
      "created_at": "2022-03-23T23:07:59.251Z",
      "ensName": "fire-defi.pod.xyz"
    },
    {
      "plaintext": "Hello everyone! Allow this to serve as my application for becoming a potential GSC delegate & candidate.\n\nEthereum Address: 0x9FfD0a5b5438B95861167422E745D34d151bcc3b\n\nDiscord Handle: Guzman_MassAdoption#0820\n\nTwitter Handle: @Guz_MassAdopt\n\nStatement of Intention:\n\nValues: Transparency, Over-Communication, Community Inclusivity.\n\nVision:\n\nI have always had a deep fascination with DAO coordination along with the foundational principle of community ownership. Being involved in multiple DAOs it has been a privilege to not only interact with the community, but to experiment and take in the adhered governance model(s). However, as we've seen lately majority of \"traditional\" (pioneering) DeFi protocols have experienced a sense voting power centralization amongst active, community thought leaders. With the emergence of meta-governance, veTokens, and now Element Finance's Voting Vault primitive, we can begin experimenting towards a true decentralized and community-orient & owned future. Ultimately, my goal is to be a true community representative/steward that directly reflects community sentiment(s), thoughts of experimentation & exploration, and overall fairness.\n\nReason why I want to become a delegate/GSC Member:\n\nIn my opinion, Element Finance is the next DeFi \"money lego\" imperative, while the GSC model is the next DeFi \"governance lego\" imperative - both of which converge towards introducing a cohesive, conducive, and scalable protocol & community.\n\nWeb3 Qualifications / Skills:\n\nIntroduced Meta-Governance model over at Blockchain Education Network\n\nActive contributor in the following DAOs/Communities:\n\nAmpleforth\n\nPieDAO\n\nFurucombo\n\nUniswap\n\nOrigin\n\nRabbitHole (RH) MetaGovernance Pod\n\nCult DAO\n\nFormer DeFi Pulse DAO Partnerships Lead\n\nRelevant Works/Proposals:\n\nUniswap Governance Renovation\n\nThe Proliferation of Meta-Governance Structures\n\nPieDAO Proposal: USD++ Revamp\n\nAmpleforth Proposal: Fixed Yield $AMPL\n\nI'm excited to see the deployment of Element Finance's Governance and can't wait to see what the future has. One thing is for certain, the future is incredibly bright for both Element Fi and DeFi Governance!",
      "commonwealthCommentId": 17615,
      "commonwealthName": "Guzman_MassAdoption",
      "commonwealthPostedFromAddress": "0x9FfD0a5b5438B95861167422E745D34d151bcc3b",
      "address": "0x9FfD0a5b5438B95861167422E745D34d151bcc3b",
      "created_at": "2022-03-23T21:11:55.172Z",
      "ensName": "massadoption.eth"
    }
  ],
  "version": "0.0.0"
}
